[{"id":"0fefe7418mq8irmbv1qun6airp","startTime":"2020-02-03T09:30:00","endTime":"2020-02-03T13:00:00","summary":"Élection CSE","description":"<span>L’élection des&nbsp;membres du CSE (instance qui succède aux Délégués du personnel, CE, CHSCT).</span>","attendees":[]},{"id":"5vnfdf9pkrseapkqq5fvj3ou8n","startTime":"2020-02-03T09:30:00","endTime":"2020-02-03T09:45:00","summary":"Plénière - Changement de marque","description":"","attendees":["ptirman@xebia.fr"]},{"id":"0pn9ncnr4o5sfh5okocolvm75s","startTime":"2020-02-03T09:45:00","endTime":"2020-02-03T10:00:00","summary":"Plénière - Brasserie connectée","description":"“A la recherche de la saveur perdue”\nNous sommes en 2120 et on a perdu la recette de la bière. \nCertains la décrivent comme un nectar qui ravivait les papilles de quiconque plongeait ses lèvres dans sa mousse délicieuse. \nDes robots cherchent donc à reproduire cette “bière” en se plongeant dans sa fabrication “à l’ancienne” : culture des céréales dans un champs, récolte, brassage,...\nPour cela le joueur pourra produire différents algorithmes lui permettant de remplir des missions de plus en plus complexes au fur et à mesure de sa progression. Il mettra à disposition de la communauté (les autres joueurs) les ressources récoltées pour permettre à l’ensemble des participants de s’appuyer sur l’effort individuel pour trouver la meilleure recette de bière. \nUn leaderboard sera mis à disposition avec les personnes ayant le plus participé à l’effort collectif.\n\nEn 15mn de plénière, nous vous raconterons ce qu'une équipe de chic et de charme a entreprit : de la naissance de l'idée aux choix des technos mais surtout nous avons besoin de vous pour nous accompagner dans cette folle aventure !","attendees":["gmathieu@xebia.fr"]},{"id":"10ffj15uasb11aelrusohs1q95","startTime":"2020-02-03T10:05:00","endTime":"2020-02-03T12:00:00","summary":"SOFT Formal - SKILLS TRACK - Système cognitif & Questionnement","description":"Après la session sur les Croyances, on enchaine avec cette track sur le système cognitif et le questionnement.\n\n**PITCH** :\nReminder ou Mise à jour de la #1 \nQue sont les filtres sémantiques et l’outil de communication qu’on appelle le méta modèle? Que faire face aux sélections d’informations, malformations et généralisations dans le langage de la part de votre interlocuteur ? Un jeu de questions vous sera présenté, ainsi que le principe de règles personnelles via la boussole de Kourilsky pour mieux comprendre l’autre entre faits, émotions et opinion mais aussi perception et interprétation.\nNous verrons comment mettre en place une réelle stratégie de questionnement en nous intéressant aux méthodes antérogrades et rétrogrades pour mieux les utiliser.\nNous verrons comment questionner pour amener vers un objectif, et plus concrètement, nous découvrirons ensemble deux outils concrets : les niveaux logiques et le SCORE de Dilts . \nUne présentation, un exercice de groupe, un take away, un temps d’échange\n\n\n**Niveau** débutant\n**Pré requis** : idéalement avoir vu la track précédente\n\n**Sommaire** :\nReminder : si vous avez manqué les épisodes précédents\nFiltres sémantiques et Questionnement - le méta modèle\nLes questions du méta modèle face aux séléctions, malformations et généralisations\nFocus règles personnelles - La boussole de Kourilsky\nLa stratégie de questionnement\nMéthode antérograde et rétrograde face à un objectif \nStratégie de questionnement face à un objectif\nOutil pratique pour questionner : les niveaux logiques de Dilts\nOutils pratique pour questionner : le SCORE de Dilts\nExercice de groupe\nTake Away\n\n*support joint *.","attendees":["asgirault@xebia.fr"]},{"id":"1rl64puubde86qgg6gs8n0utbd","startTime":"2020-02-03T10:05:00","endTime":"2020-02-03T12:00:00","summary":"Kafka Tutorials: Event Stream Book Recipe","description":"**Pitch**\n*Note*: Cette session est une reprise sur deux 2h du slot de Janvier sur Kafka Streams. Elle commencera par la seconde partie qui n’a pas pu être abordée. Il n’est pas nécessaire d’avoir vu la session précédente.\n\nIl y 1000 et 1 manières de réaliser des traitements à partir de flux de donnée avec Apache Kafka. C’est pourquoi le site kafka-tutorials répertorie des exemples complets d’applications. \nLes exemples sont testés, buildés et deployables! Dans ce talk je vous propose de décortiquer le fonctionnement de cette platform communautaire et de vous montrer comment y contribuer avec vos propres démonstrations.\n\nEnfin on finira par un exemple de tutoriel: The Final Window Result. Il s’agit d’un proposition d’alerting sur des flux continue.\n \n**Niveau**\n \ndébutant\n \n**Pré-requis**\n \nUn pupitre pour développer le live coding","attendees":["ldivad@xebia.fr"]},{"id":"443q5f1jkpdgpr5fhl6mom5gok","startTime":"2020-02-03T10:05:00","endTime":"2020-02-03T12:00:00","summary":" Hands-On - THE CODING DOJO","description":"**Pitch**\n\nThe Coding Dojo te donne rendez-vous chaque KED pour partager des pratiques autour du Software Development Done Right à travers des kata faites en binôme ou en groupe.\n\nNo slides - just code!\n\n**Niveau**\n\nTous les niveaux\n\n**Pré-requis**\n\nOrdinateur avec un environnement de développement","attendees":["ponneby@xebia.fr","achaabani@xebia.fr"]},{"id":"6ki33gilrv1phrpi6l5o9s3bm8","startTime":"2020-02-03T10:05:00","endTime":"2020-02-03T12:00:00","summary":"Google Cloud Platform Getting Started","description":"Pitch\nLe cloud de Google offre aujourd’hui un grand nombre de service, orienté Web, backend ou data.  Dans cette présentation, nous vous proposons les bases sur Google Cloud Platform afin de pouvoir répondres aux questions suivantes : \nComment (bien) démarrer ?  Comment sont organisées les ressources ? Quelles services existent et pour quel besoin ? Quelles sont les moyens mise à disposition pour monter en compétence chez PSE.\nSi votre objectif est de débuter ou de vous améliorer sur le sujet, cette présentation est faite pour vous.\nFinalement nous ouvrirons sur les actions à mettre en place afin développer l'utilisation de GCP par les xebians et chez nos client afin d'avoir plus de missions sur GCP.\n\n\nNiveau\n\ndébutant \n\nPré-requis\n\nAucun","attendees":["jbclaramonte@xebia.fr","ibeauvais@xebia.fr"]},{"id":"05nq4qa8iup6fnnpt9rkq74tfu","startTime":"2020-02-03T12:05:00","endTime":"2020-02-03T12:35:00","summary":"Certifications Kubernetes - Followup #1","description":"**Pitch**\nUn certains nombre de Xebians ont décidé de se lancer dans les certifications Kubernetes (CKAD et/ou CKA). Ce slot est pour ces Xebians : nous y partagerons des objectifs communs, des tips & tricks liés à la certification, et d'autres choses encore.\n\nCe slot est dissocié de la Kubernetes Winter School - les deux sont complémentaires, mais l'un n'est pas indispensable pour  l'autre !\n\n**Niveau**\nWanna-be certified (CKAD / CKA)\n \n**Pré-requis**\nAucun","attendees":["achotard@xebia.fr"]},{"id":"2falbf08ueo6ruqtnb6re39jad","startTime":"2020-02-03T12:05:00","endTime":"2020-02-03T12:30:00","summary":"Point sécu Android 2020","description":"**Pitch**\nDiscutons sécurité sous Android en 2020.\nÀ quoi ça sert d'être Root ?\nPourquoi y a t'il autant de stores alternatifs ?\nSi je veux savoir ce que fait mon téléphone je fait comment ?\n \n**Niveau**\ndébutant\n \n**Pré-requis**\nRien","attendees":["mohayon@xebia.fr"]},{"id":"6knkt7ljejfmd7u50tf54fnn19","startTime":"2020-02-03T12:05:00","endTime":"2020-02-03T12:30:00","summary":"Formal - TCR une alternative au TDD ?","description":"**Pitch**\nQu'est ce que le TCR ? Comment l'appliquer ?\nJe vous propose une petite présentation sur ce concept, ainsi qu'une démo/live coding sur son application, nous pourrons ensuite échanger sur le sujet.\n\n**Niveau**\nTous niveaux","attendees":["rrobez@xebia.fr"]},{"id":"7v6eithbsvsahr8srmoks4qrs0","startTime":"2020-02-03T12:05:00","endTime":"2020-02-03T13:00:00","summary":"Hands-on SAFE en 1h","description":"**Pitch**\n \nL'objectif est de présenter SAFe à des personne connaissant déjà les pratiques Agiles comme Scrum - Petit jeu en entrée et prez/question en plat principal ;)\n \n**Niveau**\n \nmoyen\n \n**Pré-requis**\n \nConnaitre les principes agiles ou Scrum","attendees":["iroques@xebia.fr"]},{"id":"12ojonfef7fsidkqts22rv7rou","startTime":"2020-02-03T12:35:00","endTime":"2020-02-03T13:00:00","summary":"Formal - Les deux vitesses de la pensée","description":"**Pitch**\n\nLe but de ce slot est de découvrir le principes des deux vitesses de la pensée, une théorie de Daniel Kahneman.\nLes deux modes de pensée sont le système 1 (rapide, instinctif et émotionnel) et le système 2 (plus lent, plus réfléchi et plus logique).\n \n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**\n\nAucun","attendees":["bdepompignan@xebia.fr"]},{"id":"4hinq9aue5ug94jcvtrsu7k59o","startTime":"2020-02-03T12:35:00","endTime":"2020-02-03T13:00:00","summary":"Lightning Talk","description":"**Les stratégies de vote en milieu agile (scauglog)**\n\nLes agilistes aime bien nous faire voter sur tout et n'importe quoi. Le problème c'est que certains de vos coéquipiers ne votent pas correctement. Venez découvrir comment manipuler les résultats. Et si vous êtes sage la parade à ces manipulations.\n \n\n** Les conteneurs éphémères dans Kubernetes (O. Cloirec)**\n\nComment debugger proprement vos pods avec des conteneurs éphémères.\n\n\n** Les petits conteneurs (F. Cussac)**\n\nComment optimiser la taille de ses images dockers ?\n(débutant)\n\n** YOLO - You Only Look Once (Qian Jin) **\n\nComment faire de la détection d'objet en temp réel ? C'est quoi les états des arts pour les plateformes Android et iOS ? \n\n**Les Tests d'Infrastructure (Horgix)**\n\nSouvent, un des arguments à l'infrastructure-as-code est : \"comme ça on peut faire des tests automatisés sur l'infra en plus !\". Est-ce que ça a vraiment du sens ? Quels outils existent ? Ce LT est une intro au sujet en vue d'en faire un talk de 1h avec Guillaume L.","attendees":["fcussac@xebia.fr","qjin@xebia.fr","rsagean@xebia.fr","ocloirec@xebia.fr","achotard@xebia.fr"]},{"id":"5914f6ba2roc98ml4u02vq722e","startTime":"2020-02-03T12:35:00","endTime":"2020-02-03T13:00:00","summary":"Commerce - Sale(s) journey","description":"**Pitch**\nInspiré comme jamais je me suis lancé le défi de vous créer une présentation fun et marrante pour parler du commerce et de notre bienveillance légendaire.\n\nL'objectif est de vous (re)présenter notre quotidien, notre vision et l'équipe 2020, le tout sous forme de mèmes internet!  C'est l'occasion de venir avec vos idées et vos questions pour avoir des réponses (ou pas).\n\n**Niveau**\nPour tout le monde\n \n**Pré-requis**\nNon","attendees":["jmarchand@xebia.fr"]},{"id":"550audcnat1nsovrcv45qq5r6s","startTime":"2020-02-03T13:05:00","endTime":"2020-02-03T14:00:00","summary":"Déjeuner","description":"Lieu : cafétéria, au 3e étage\nQuantités :\n1 part de quiche\n½ sandwich baguette\n1 salade\n1 dessert","attendees":[]},{"id":"5g6bsc5f9ba399snnvs8gpc569","startTime":"2020-02-03T14:05:00","endTime":"2020-02-03T14:25:00","summary":"Newcomers","description":"","attendees":[]},{"id":"30ic5mkf0jr0vv2sg58913pnl9","startTime":"2020-02-03T14:25:00","endTime":"2020-02-03T14:30:00","summary":"Plénière - Appel à contribution pour Xebia Essentials","description":"","attendees":["esiha@xebia.fr"]},{"id":"147tlmjsinh7dq7u16pm3em6j7","startTime":"2020-02-03T14:35:00","endTime":"2020-02-03T18:30:00","summary":"Élection CSE","description":"<span>L’élection des&nbsp;membres du CSE (Instance qui succède aux Délégués du personnel, CE, CHSCT).</span>","attendees":[]},{"id":"3d6i8hg1k19ufas0e4ivpva3te","startTime":"2020-02-03T14:35:00","endTime":"2020-02-03T16:30:00","summary":"Atelier - Serious Game Systémique et Mesure. Beergame Itératif","description":"**Pitch**\n \nBasé sur le jeu \"Beer Game\", serious game permettant de toucher du doigt la systémique, je vous propose d'itérer sur ce jeu sur une version dématérialisée.\nL'ambition est de discuter systèmique, mesures du système, amélioration locale/globale et engagement... \nOn discutera aussi de mesure de l'avancement vs. mesure de l'impact...\n\n \n**Niveau**\n \ndébutant\n \n**Pré-requis**\n \nLe jeu fonctionne par multiple de 4...\nChaque participant doit être équipé d'un laptop connecté.","attendees":["ldussault@xebia.fr"]},{"id":"3uhfdd1l85b4rp34319ogd6kqi","startTime":"2020-02-03T14:35:00","endTime":"2020-02-03T15:30:00","summary":"1h - Hands-on Brasserie connectée","description":"Suite à la plénière du matin vous avez envie d'en savoir plus et de mettre les mains dans le cambouis avec des passionnés bien trop cool ?\nAlex, Thomas Guillaume et Guillaume rentrerons plus dans les détails : ils vous donneront de la visibilité sur l'état réel des différents choix produit, technos et gentillesse. \nL'objectif est de savoir si vous avez envie de rejoindre l'équipe de chic et de charme.","attendees":["amourany@xebia.fr","gmathieu@xebia.fr","gbarbier@xebia.fr","tsimonnet@xebia.fr"]},{"id":"5fm8cpehamrdgqtuor18pn798n","startTime":"2020-02-03T14:35:00","endTime":"2020-02-03T16:30:00","summary":"Hands-On - Jetpack Compose","description":"**Pitch**\n \nGoogle et l'équipe Android proposent une nouvelle approche pour créer des composants visuels (UI) sur Android : UI as Code.\n\nUI as Code sur Android = Jetpack Compose.\n\nC'est nouveau, encore en développement (nécessite Android Studio Canary) mais c'est très prometteur !\n\nDans ce hands-on vous pourrez tester Jetpack Compose à travers des morceaux d'interface à développer en Compose.\n\nCertains trolls pourraient dire que c'est React.FC sur Android. Venez pour nous dire si c'est vrai :-) \n\n**Niveau**\n \nDébutant (même si vous n'avez pas fait d'Android)\nConnaissance de Kotlin nécessaire\n \n**Pré-requis**\n \nInstaller Android Studio 4.0 Canary + un émulateur >= Api 21","attendees":["mohayon@xebia.fr","srayapoulle@xebia.fr","blacroix@xebia.fr"]},{"id":"7m06nro0dl7ph3in4qfgaj4t4u","startTime":"2020-02-03T14:35:00","endTime":"2020-02-03T15:30:00","summary":"Formal - GRPC, une autre manière d'écrire mes APIs","description":"La création des services REST est la manière la plus populaire de connecter mes services. Cependant, il y a des technos différentes pour les implementer, par exemple GRPC.\nLe but ce cet slot est de présenter la technologie, des outils et implementations basiques","attendees":["dortega@xebia.fr"]},{"id":"33mj6ne749pajvj6pih6gm7eqo","startTime":"2020-02-03T15:35:00","endTime":"2020-02-03T16:30:00","summary":"Atelier - Build our DevOps Assessment Card Game !","description":"**Pitch**\nDans la lignée des cartes d'assessment d'équipe général / produit je vous propose de décomposer les quelques cartes DevOps en profondeur :(https://docs.google.com/presentation/d/1ecC3RViF9mtU1WqA_CeN0_wf8Q0a4R0fxuT8x3yYOHA/edit#slide=id.g6be5bc7b3a_0_0)\n\nL'idée : le jeu nous permet de :\n- Visualiser l'effet que nous avons sur les équipes à travers l'amélioration dans le temps (consulting)\n- Connaître les forces / faiblesses de notre équipe et décider où progresser collectivement\n- Auditer un client (et potentiellement construire un plan court/moyen/long terme)\n- Avoir un truc à la fois packagé Xebia/PSE mais également packagé Client qu'on leur laisse (customer intimacy vu qu'on colle leur logo au dos)\n- Disposer d'un jeu d'assessment pour nos entretiens techniques (le candidat se note et on débrief)\n- Disposer d'un jeu d'assessment personnel (genre nos objectifs de l'année, sur quoi nous désirons personnellement progresser vs avons-nous progressé etc...)\n\nPuis bordel y'a une licorne sur le look&feel !!!! UNE LICORNE (si avec ça j'ai pas au moins 10 personnes...)\n \n\n**Niveau**\nDevOps dans l'âme ! Kiffer la CI/CD\n \n\n**Pré-requis**\nNope","attendees":["achotard@xebia.fr","abrebant@xebia.fr"]},{"id":"613mkvn8je8dgs071hrugfca0t","startTime":"2020-02-03T15:35:00","endTime":"2020-02-03T16:30:00","summary":"Le design pattern \"State\" revisité...","description":"**Pitch**\n...avec des technos modernes\n*éventuellement live-coding*\nHas been, les design pattern ? Ouais mais bon ils ont bien servi... à ceux qui n'en ont pas trop abusé ! ;)\nSi comme moi vous vous demandez si le modèle acteur peut remplacer le \"State pattern\", venez voir,  nous vérifierons ça ensemble et nous pourrons critiquer. Le diagramme de classe va-t-il être simplifié ? Qu'allons nous gagner à faire une machine à état fini avec Akka plutôt qu'un DIY State pattern ?\nTrolls tenus en laisse autorisés.\n**Niveau**\n???\n\n**Pré-requis**\n???\n\n**Logistique**\nprojecteur HDMI full HD","attendees":["jrousseau@xebia.fr"]},{"id":"6ccb9q4v45u6paoqco1697gcuc","startTime":"2020-02-03T16:35:00","endTime":"2020-02-03T17:30:00","summary":"Formal - Comment Meetic s'est renouvelé en UX ?","description":"**Pitch**\n \nJ’interviendrai avec le designer Aymeric Joubert et analyserai : comment Meetic a construit les premières pierres d’un Design System pour assurer une expérience utilisateur de qualité ?\nPrésentation UD, Design System, Atomic design, Coopération\n\n**Niveau**\n \ndébutant / moyen / expert\n \n**Pré-requis**\n \nAucun","attendees":["uteke@xebia.fr"]},{"id":"71aujmlqpe586419sur0fdfeqm","startTime":"2020-02-03T16:35:00","endTime":"2020-02-03T17:30:00","summary":"Debate - De la transparence dans l'évaluation des performances","description":"**Pitch**\n\nNous avons tous besoin de feedback, de savoir si notre travail est impactant, de connaître nos axes d’amélioration ainsi que nos forces, et pas uniquement en fin d'année lors de notre entretien annuel.\n\nAfin d'être capables d'évaluer notre travail, voir de s'auto-évaluer, il est important de savoir sur quels axes notre travail est évalué et comment l'influencer positivement.\n\nJ'ai pour ambition de donner plus de transparence à tous dans l'évaluation de ses performances et d'avoir des discussions qui ne soient pas unidirectionnelles avec son manager à ce sujet.\n\nDurant ce slot, je vais vous proposer différents axes et critères que j'aimerais que vous challengiez afin de construire de manière collégiale la manière d'évaluer notre travail.\n\n**Niveau**\nPour tous\n \n\n**Pré-requis**\nAucun","attendees":["ybenoit@xebia.fr"]},{"id":"7nho9ln9mgfj86act0hohfjh8h","startTime":"2020-02-03T16:35:00","endTime":"2020-02-03T17:30:00","summary":"Formal - Les arcs dramatiques appliqués à l'expérience utilisateur","description":"Les arcs dramatiques (ou, plus strictement, les \"arcs de tension/courbes de tension\") sont un moyen de regarder les expériences et de comprendre pourquoi elles sont satisfaisantes ou non.\nIls sont utilisés en User Experience et en service Design. \nJe vous propose de vous les faire découvrir à travers quelques exemples .","attendees":["fzhamil@xebia.fr"]},{"id":"7p31b75pbtkglua0716ri6ljm9","startTime":"2020-02-03T16:35:00","endTime":"2020-02-03T17:30:00","summary":"Formal / Démo - Orchestration : Conteneurs vs Musique","description":"**Pitch**\nLe concept d'orchestration dans le domaine de l'informatique a été popularisé avec l'avènement des conteneurs. Mais il existe depuis bien longtemps en musique ! A-t-il la même signification dans ces deux contextes ? Peut-on vraiment établir un parallèle ? Et le chef d'orchestre dans tout cela, y trouve-t-il sa place ?\nNous aborderons la question dans cette conférence au travers d'exemples concrets et de démonstrations, dans le but de vous en faire ressortir avec de solides notions d'orchestration(s) ... et de bonne musique.\n \n**Niveau**\ndébutant\n \n**Pré-requis**\nPas mal de matériel son de ma part ou de la régie => à voir et négocier rapidement avec régisseur","attendees":["ocloirec@xebia.fr"]},{"id":"0ppsc4587pmf2d30id2mhgm7oo","startTime":"2020-02-03T17:35:00","endTime":"2020-02-03T18:30:00","summary":"Fondation Mobile","description":"","attendees":[]},{"id":"0vhfupetioddgj28mhstfoe6f4","startTime":"2020-02-03T17:35:00","endTime":"2020-02-03T18:30:00","summary":"Fondation agile","description":"","attendees":[]},{"id":"4ak39m18ft4op7kk2gbbstfft7","startTime":"2020-02-03T17:35:00","endTime":"2020-02-03T18:30:00","summary":"Fondation Data","description":"","attendees":[]},{"id":"5iffialt0eu75ntbpplfsg1l2a","startTime":"2020-02-03T17:35:00","endTime":"2020-02-03T18:30:00","summary":"1 h - Mentoring - Kubernetes Winter School #5","description":"","attendees":[]}]