[{"id":"275kgdaimqdmu2fs99a2a9suh9","startTime":"2019-10-07T09:00:00","endTime":"2019-10-07T19:00:00","summary":"XKE","description":"","attendees":[]},{"id":"3sdn4lt5oauuo0fqaavmqkdndj","startTime":"2019-10-07T09:00:00","endTime":"2019-10-07T09:35:00","summary":"Petit déjeuner","description":"","attendees":[]},{"id":"49gol3tmdlfrcnfqqosgu7oqhr","startTime":"2019-10-07T09:35:00","endTime":"2019-10-07T10:05:00","summary":"Plénière - Visibilité externe","description":"Pitch\nÀ découvrir\n\nNiveau\ndébutant\n\nPré-requis\nAucun","attendees":["jpinsolle@xebia.fr"]},{"id":"154rijjagg8t97s620jdh51r0c","startTime":"2019-10-07T10:05:00","endTime":"2019-10-07T11:00:00","summary":"Formal - DBT n'est pas celle que vous croyez","description":"Pitch\n\nDBT Done Right.\nTrolls et débatteurs de tout poil bienvenus.\n\nNiveau\n\nDébutant\n\nPré-requis","attendees":["plopez@xebia.fr"]},{"id":"3l6fa0nguai6n30k8fb9t5b10n","startTime":"2019-10-07T10:05:00","endTime":"2019-10-07T10:30:00","summary":"Formal - [Xebicon] Le syndrome de l'imposteur","description":"Comment (et pourquoi) le syndrome de l'imposteur se manifeste chez le développeur, et comment en venir à bout","attendees":["sbuisson@xebia.fr"]},{"id":"47eio36mbjg4ngjrk6g36t3qj5","startTime":"2019-10-07T10:05:00","endTime":"2019-10-07T10:30:00","summary":"Formal / Debate - Découvrons les métiers de nos copains de Sapient- Episode 1 - UX","description":"Speaker : Gaetan Jestin - Directeur de Création PS\n\nJe m’appelle Gaëtan, je suis petit… mais breton ! Je suis DA chez Publicis Sapient, *ça ne veut pas dire distributeur automatique - mais directeur artistique. Cela fait 4 ans que je suis dans l’agence ce qui correspond à 28 années pour un épagneul breton, et je travaille sur la communication de la boîte, sur du social media, des app etc. Je suis là pour vous partager mon expérience et ce qui me passionne !","attendees":[]},{"id":"7ddj7d5fr93njrgcvjiq8buho7","startTime":"2019-10-07T10:05:00","endTime":"2019-10-07T12:00:00","summary":"Formal & Discussion - Scrumban : Voyage au bout du chemin Scrum... mais à chemin battu ne croît point l'herbe...","description":"**Pitch**\n\nLe Scrumban. \nLe mix entre Scrum et Kanban.\nOn en a tellement entendu parlé mais on dirait que personne n'a jamais vu de ses propres yeux.\n\nOn nous a préparé un chemin battu - Scrum. Mais à quel étape de la vie d'une équipe agile, à quel moment précis vous commencez à ressentir le besoin de devoir sortir des chemins battus afin de retrouver la vie, les couleurs, l'herbe douce sous les pieds, le soleil réchauffant et le vent frais ainsi que votre petit chemin, rien qu'à vous ? À quel moment on cherche un concept (méthode, framework) encore plus puissant, plus englobant que la \"chaussée asphaltée\" du Scrum ?\n\nVenez découvrir l'explication détaillée de comment passer du Scrum vers le développement en continu cadencé. Peut-être vous essayez d'en faire déjà : mais avez-vous bien intégré tous les principes Agiles et Lean pour réussir la mutation à partir du Scrum vers quelque chose encore plus puissant ? \nRappel des bases et step-by-step du Kanban pour retrouver... Scrumban. \n\nPrésentation formelle de +/- 1h15 suivie par une discussion pour échanger sur les expériences.\n\n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**\n\nNéant","attendees":["jbrambor@xebia.fr"]},{"id":"1h0asqivp1u48eifn9s8t0b4cr","startTime":"2019-10-07T10:35:00","endTime":"2019-10-07T11:00:00","summary":"Formal / Debat - Découvrons les métiers de nos copains de Sapient- Episode 2 - Motion Design","description":"\nSpeaker : David Sultan.\nJe m’appelle David et je suis un mec super sympa, grand, fort, beau…. ! \nMais pas que ça, je suis aussi le responsable du studio, anciennement le pôle motion. \nOn fait plein de truc cool dans l’équipe. \nDe la photo, de la vidéo, des animations, de la 3D. \nEn gros tout ce qui bouge c’est nous ! \nJe vais vous montrer comment on travaille et des projets qui émerveillera petits et grands !","attendees":[]},{"id":"6nrgmsovhbhjfj5r93ma1g681i","startTime":"2019-10-07T10:35:00","endTime":"2019-10-07T11:00:00","summary":"Formal - [xebicon] Lis mon code ou pour quoi j'ai du mal à faire ta code review","description":"Si vous êtes un développeur, peut-être que vous vous demandez comment mieux écrire le code pour qu'il soit fonctionnel, efficace et correcte.\n\nJ'ai constaté que plus vous utilisez des langages différents, moins vous pouvez appliquer des absolus. Pour exemple, la réponse à la question si mon code est lisible ou pas, commence par \"cela dépend...\".\n\nLa “Limite Cognitive 4”, indique qu'une personne moyenne peut conserver jusqu'à quatre idées (plus ou moins une) dans sa mémoire à court terme. Mais, peut-on extrapoler au code? Et si en fait, certains concepts psychologiques sont applicables pour améliorer la lisibilité du code?\n\nAvec ce talk, je vais me concentrer sur des règles et concepts de la psychologie avec des exemples concrètes sur le code, pour trouver les paramètres générales, qui nous aident à identifier le code qui est lisible par rapport au code qui ne l'est pas.","attendees":["dortega@xebia.fr"]},{"id":"1rksn59qf7c1307m4f0en0avac","startTime":"2019-10-07T11:05:00","endTime":"2019-10-07T11:30:00","summary":"Formal - [XebiCon] Atomic Design Driven Development","description":"**Pitch**\n \nLe design system est une méthodologie UI / UX qui permet de construire des applications web composant par composant. Les composants du design system sont ensuite déclinés en atomes, molécules, organismes, templates et enfin pages.\n\nCe slot vous propose une présentation de l'atomic design ainsi qu'une démo expliquant comment le développeur contribue à ce système.\n \n**Niveau**\n \n🌶️\n\n#vuejs #storybook #atomicdesign","attendees":["blacroix@xebia.fr","jsmadja@xebia.fr"]},{"id":"3ejnm11bal4ji9hiqsbnufejke","startTime":"2019-10-07T11:05:00","endTime":"2019-10-07T12:00:00","summary":"Formal/Live-code - Mikado Method","description":"**Pitch**\n\nVous avez du code legacy ? Vous avez essayé de le restructurer sans succès ?\nNous verrons ensemble comment organiser des restructurations de n'importe quel taille avec cette méthode simple et efficace\n \n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**","attendees":["ponneby@xebia.fr","achaabani@xebia.fr"]},{"id":"55i601k4gvh9smj3cm4mo5o7lm","startTime":"2019-10-07T11:05:00","endTime":"2019-10-07T11:30:00","summary":"Formal - L'éthique du Big Data (Xebicon 2019)","description":"La grande majorité des entreprises se lancent avec beaucoup d’effervescence dans de nombreux projets d'innovation Big Data. En parallèle, nous observons de plus en plus de réticence de la part des utilisateurs en tant que source de données. Bien que les origines de ces craintes soient multiples, c'est souvent l'éthique qui est remise en question.\n\nPendant ce talk nous allons parler des principes éthiques du Big Data, de la modélisation éthique et ensuite proposer des pistes de réponses accompagnées de solutions déjà existantes sur le marché.\n\nNiveau : débutant","attendees":["spietrowska@xebia.fr","rmatusiak@xebia.fr"]},{"id":"0d4a90dmndo3j2p6ffk7beg97t","startTime":"2019-10-07T11:35:00","endTime":"2019-10-07T12:00:00","summary":"Formal - Spark sur K8S avec S3 [XebiCon]","description":"**Pitch**\n\nSpark, couplé à des solutions de type Object Storage, offre désormais la possibilité d'exécuter des traitements sur un Kubernetes managé sans passer par une distribution lourde à mettre en oeuvre.\n\nCe talk vous présentera les méthodes que l'on a expérimenté pour y parvenir et vous présentera les pièges à éviter mais surtout les solutions qui ont fonctionné dans notre cas.\n\nOn vous présentera :\n\n- les possibilités pour déclencher un job (opérateurs Kubernetes, spark-submit, ...)\n- les ressources Kubernetes générés par Spark\n- les paramètres utiles à l'exécution des Jobs\n- la configuration de la connexion avec l'object storage\n- une méthode pour suivre l'exécution de ses Jobs\n \n**Niveau**\n \ndébutant / moyen\n \n**Pré-requis**\nRétro projecteur","attendees":["galbini@xebia.fr","sdossantos@xebia.fr"]},{"id":"45faghfbd5l5eddcn3efkq38bl","startTime":"2019-10-07T11:35:00","endTime":"2019-10-07T12:00:00","summary":"Demo - Créons des animations avec MotionLayout","description":"**Pitch**\n\nVous avez toujours voulu créer de meilleurs animations ? Découvrons les capacités de MotionLayout dont la beta-1 a été publié pendant la Google I/O. Ce composant promet de simplifier les animations en créant des animations avec du XML. Cette dernière peut être connectée à swipe ou un composant.\n\nNous commencerons explorer par des exemples simples de modification de contraintes, puis nous ajouterons des KeyFrame pour changer la position, la taille et la rotation. Ensuite nous changerons des attributs personnalisés pour modifier l’image, la couleur, et la saturation de l’image. Enfin, nous explorerons comment connecter des vues MotionLayout avec un Coordinator Layout, ViewPager, Drawer et SeekBar.\n\nEn repartant de ce talk, vous pouvez connaître les capacités de MotionLayout.\nDevez-vous l’utiliser dans votre application ?\n\n**Niveau**\n\nexpert","attendees":["agenet@xebia.fr"]},{"id":"4i8rr6jr28pfpv2jvuffdms4nq","startTime":"2019-10-07T12:05:00","endTime":"2019-10-07T13:00:00","summary":"Debate - [Keynote Xebicon19] - discussion sur la partie ML (we need you)","description":"**Pitch**\nL'équipe ML présente de manière sommaire :\n- les modèles entraînés, \n- les résultats obtenus, \n- les travaux en cours\n- les questions/difficultés qui se posent\n\n...on en discute tous ensemble et on en retire des pistes de travail pour l'équipe ML\n\nMerci d'avance :)\n\n**Niveau**\nTout le monde\n \n**Pré-requis**\nAucun","attendees":["jjublanc@xebia.fr","nlaille@xebia.fr"]},{"id":"4plrkfqssf7krumhj0pdqc5h2s","startTime":"2019-10-07T12:05:00","endTime":"2019-10-07T12:30:00","summary":"Live coding - Scala - FP et ses gros mots. Episode 2, side effect","description":"**Pitch**\n\nMonad, Functor, covariance, contravariance, composition, curryfication... Vous avez déjà tenté de rechercher leurs définitions ? Moi oui, et j'ai rien compris. Pourtant j'en fais tous les jours. Et vous aussi peut être, comme l'autre qui faisait de la prose sans le savoir.\n\nJe vous propose un slot en plusieurs parties, où chaque mois nous verrons en 30 minutes un concept de programmation fonctionnelle appliqué en Scala.\n \nDans ce deuxième épisode, je vous propose de découvrir la hantise de la programmation fonctionnelle : les effets de bord.\n\n\n**Niveau**\nDébutant\n \n\n**Pré-requis**\nvidéo-projecteur / télé\nchaise + table / pupitre","attendees":["fcussac@xebia.fr"]},{"id":"5aq23qcvtbh3a94ne2n48381ki","startTime":"2019-10-07T12:05:00","endTime":"2019-10-07T12:30:00","summary":"Lighting Talks #1","description":"5min - @Peter Önneby - Formal - [Xebicon] Strong Style Pairing\n5min - @Alexandre Genet - Formal - [Xebicon] Mobile First done right\n\n--------------------------------------------------------------------------------------------------------------\nFormal - [Xebicon] Strong Style Pairing\n**Pitch**\nVous faites du pair programming ? Est-ce que vous vous échangez le clavier régulièrement ? Et la comprehension du code que vous écrivez est elle claire ? Y a-t'il une meilleur façon de faire du pair programming ?\n\n**Niveau**\n\ndébutant\n\n--------------------------------------------------------------------------------------------------------------\nFormal - [Xebicon] Mobile First done right\n**Pitch**\n\nDans les transports, en voyage ou simplement dans son lit, l’usage du mobile est partout. Comment créer la meilleure application mobile ? Embarquons ensemble pour un tour d’horizon des usages et solutions.\n\nAvec une batterie et un réseau limité, qu’est-il nécessaire de télécharger en avance, si possible en une seule requête optimisée ?\nAvec un petit écran qu'elles sont les guidelines pour une navigation optimale ?\nAvec les nouveaux canaux de communication comment être au service de son utilisateur ?\nAvec deux plateformes (iOS/Android) différentes, comment tirer des avantages de l’un et de l’autre ?\n\nRepartez avec les bonnes pratiques et idées pour faire de belles applications pour vos utilisateurs.\n \n**Niveau**\n\ndébutant","attendees":["ponneby@xebia.fr","agenet@xebia.fr"]},{"id":"6krukuupe7lc2vlnj3tur72n4b","startTime":"2019-10-07T12:05:00","endTime":"2019-10-07T13:00:00","summary":"Formal / REX TF1 - Quelle implémentation agile sur MyTF1 ?","description":"**Pitch**\n\nRetour d'expérience sur un an de projet chez TF1. Notre mission, refondre les applications Web / iOS et Android de MyTF1.\n\nComment nous sommes nous organisés pour sortir les produits de MyTF1 dans un environnement en plein bouleversement à différents niveaux.\n \n**Niveau**\n \nDébutant \n\n**Pré-requis**\n \nTrouver la salle.","attendees":["gegron@xebia.fr"]},{"id":"44iah58mdaoc1qsev062uq50s3","startTime":"2019-10-07T12:35:00","endTime":"2019-10-07T13:00:00","summary":"Lighting Talks #2","description":"@Alexis \"Horgix\" Chotard - Lightning - [XebiCon] Docker est mort, vive Docker !<br>@Benjamin Lacroix - Lightning - [XebiCoon] Flutter en 5 min ⏰<br>@Alexis \"Horgix\" Chotard - Lightning - Vim motions 101<br><br>--------------------------------------------------------------------------------<br>Lightning - [XebiCoon] Flutter en 5 min ⏰<br>**Pitch**<br>&nbsp;<br>Flutter ? Que vous ne connaissiez pas, ou que vous en ayez juste entendu parler, Benjamin vous propose une introduction aux avantages et aux inconvénients du framework : Flutter, le dernier framework pour les contrôler tous ?<br>&nbsp;<br>**Niveau**<br>&nbsp;<br>🌶️<br>&nbsp;<br>#mobile<br><br>--------------------------------------------------------------------------------<br>Lightning - [XebiCon] Docker est mort, vive Docker !<br>**Pitch**<br>Répétition XebiCon.<br><br>Docker est désormais partout. Mais que fait réellement Docker ? Y a-t-il encore un sens à parler de Docker maintenant qu'il s'agit du simple packaging du projet [Moby](<a href=\"https://mobyproject.org/\">https://mobyproject.org/</a>), qui lui-même n'est qu'une interface vers [containerd](<a href=\"https://containerd.io/\">https://containerd.io/</a>) et [runc](<a href=\"https://runc.io/\">https://runc.io/</a>) ? Le sujet de \"build des conteneurs Docker sans Docker\" est sur toutes les lèvres de l'écosystème Kubernetes. Côté runtime, Docker en vient de plus en plus a être remplacé. Faisons le point sur cette situation et l'avenir potentiel de Docker.<br><br>**Niveau**<br>Tout le monde<br>&nbsp;<br>**Pré-requis**<br>Aucun<br>--------------------------------------------------------------------------------<br>Lightning - Vim motions 101<br>**Pitch**<br>Jeudi soir, 17h56 :<br><br>&lt;Giulia&gt; \"Comment je fais pour copier une ligne sur vim encore ?\"<br>&lt;Horgix&gt; \"[Réponse]\"<br>&lt;Alexis K.&gt; \"Mais c'est pas en mode visuel ça ?\"<br>&lt;Horgix&gt; \"...\"<br>&lt;Alexis K.&gt; \"Mais le mode visuel c'est pas le mode par défaut ?\"<br>&lt;Horgix&gt; \"Non. [Part dans un ode à vim et au combo operation/motion]\"<br>&lt;Alexis K.&gt; \"Ouais enfin vim il faut toujours faire des rituels sataniques...\"<br><br>Si comme Alexis K. vous trouvez que Vim c'est obscure et nécessite de sacrifier des chèvres pour vous en servir, ce LT est pour vous ! Vous repartirez avec des notions utilisables directement et  faciles à appréhender.<br><br>**Niveau**<br>Tout le monde<br>&nbsp;<br>**Pré-requis**<br>Aucun","attendees":["blacroix@xebia.fr","achotard@xebia.fr"]},{"id":"4rrfa4pu78j62nnfe8iauahvlq","startTime":"2019-10-07T12:35:00","endTime":"2019-10-07T13:00:00","summary":"Formal - Protobuf, l'outil pratique de serialisation de google","description":"**Pitch**\n\nOn se lance à la découverte de protobuf, on outil de sérialization qui permet d'échanger des informations dans un format très simple et très léger\n \n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**\n\nAucun","attendees":["oghizzo@xebia.fr"]},{"id":"4ihq5620vvkblhhsivqj4nbmia","startTime":"2019-10-07T13:05:00","endTime":"2019-10-07T14:05:00","summary":"Déjeuner","description":"","attendees":[]},{"id":"0k92dckl1bhllafkdgppsuoo1j","startTime":"2019-10-07T14:05:00","endTime":"2019-10-07T14:30:00","summary":"Newcomers","description":"","attendees":[]},{"id":"5urrtcm1mkpfk5lmbpvlmvbd9c","startTime":"2019-10-07T14:35:00","endTime":"2019-10-07T15:30:00","summary":"Hands-on / Debate - Principes d'architectures","description":"Pitch \nCe slot est un session de travail collaborative afin de définir les contours d'un nouvel atelier que j'aimerais proposer lors des sessions d'eXtrem Archi.\n\nL'idée est d'établir une liste de principes directeurs qui doit guider les réflexions.\n\nNiveau\nLa session est ouverte à tous, mais sera probablement plus efficace sur un groupe réduit à une vingtaine de personnes\n\nPrerequis\nRien","attendees":["plopez@xebia.fr"]},{"id":"65dp2h4ch6e22f5h0ae9kmei0l","startTime":"2019-10-07T14:35:00","endTime":"2019-10-07T15:30:00","summary":"Atelier - Les drivers en Analyse Transactionnelle","description":"\nPitch\n\nC'est quoi un driver ? \n\nComme son nom l'indique, le message qui te drive dans la vie !\nIl y en a 5:\n- Sois fort\n- Fais des efforts\n- Fais plaisir\n- Sois parfait\n- Dépêche toi\n\nJ'ai eu un feedback hyper positifs en mission. J'ai proposé aux gens de passer un test qui prend genre 10 minutes, je le mets en PJ. Merci de ne pas diffuser tel quel, je vous le partage mais ça vient de l'école où je suis actuellement ma formation en coaching pro. :)\n\nA l'issue de ces 10 minutes, je fais une présentation sur les drivers, les forces, les faiblesses, les risques, la gestion sous stress et la com entre les individus en fonction des drivers.\nSur le test mené sur le terrain, il a été marrant de voir que la majorité des gens avaient le driver Fais plaisir, ils s'entendaient bien, c'était fluide, mais par contre il y avait d'autres travers.... Avec l'un d'eux, qui lui avait à l'inverse un sois fort, ça passait moins bien : cette personne a de la difficulté à parler de ses besoins, encore plus de ses émotions : on est au boulot, c'est pas le lieu ( #croyance ) ^^\nBref, c'est une autre lecture du travail collaboratif sans prétention.\n\nPour que le slot fonctionne, veuillez me demander le test (cf.mail).\n\n- Tous les gens qui veulent venir au slot font le test avant\n- Le jour J, répartition dans la salle par driver ! Et vous verrez, rien que ça c'est fun.\n- Je présente les drivers : forces, faiblesses, risques, gestion sous stress\n- On finit par des questions","attendees":["asgirault@xebia.fr"]},{"id":"6kgql1hgsajqk0t9e3vt4e0g2g","startTime":"2019-10-07T14:35:00","endTime":"2019-10-07T15:00:00","summary":"[Xebicon] Attachez vos ceintures, le deep learning a embarqué !","description":"Répétition Xebicon: \nDémocratiser le deep learning est l'un des challenges les plus passionnants que tente de relever la communauté data. À l'aide de GPUs embarqués dans des cartes ultra-performantes, de nouvelles possibilités s'ouvrent à nous pour relever ce challenge.\n\nVenez découvrir à travers ce talk comment concrétiser un projet utilisant du deep learning embarqué. Nous nous aiderons de la toute dernière Nvidia Jetson Nano pour faire tourner des réseaux de neurones profonds (deep neural network ou DNN) et faire chauffer des GPUs. Nous présenterons pas à pas les étapes entreprises pour mener à bien un tel projet, en partant de l'installation de la carte jusqu'à faire de la reconnaissance d'images en temps réel.","attendees":["mcherifi@xebia.fr"]},{"id":"7aqaejctpe2vlj3aq502qoj7ro","startTime":"2019-10-07T14:35:00","endTime":"2019-10-07T15:30:00","summary":"Hands-on - JIRA clinic","description":"Vous avez un pb sur JIRA ? Vous voulez tester les meilleurs plugins ? Vous avez besoin de discuter de best practices avec d’autres ou de prototyper une solution pour votre mission ?\nVenez donc participer a cet open forum sur JIRA. \nA la fin chaque groupe fait un feedback sur les conclusions qu’ils ont tirés de leur discussion. \nUne instance Jira Server commune avec des plugins phares sera mis a votre disposition. \nVenez avec votre laptop et du wifi !\n\nLes plugins:\n\nJIRA Portfolio\nThe agile roadmapping app, built for Jira Software\n\nBig Picture\nRoadmap, Resources, Risk Management. SAFe®, Portfolio for Jira Compliant. Project Portfolio Management (PPM) & Resource Management\n\nStructure\nVisualize, track and manage projects at scale with adaptable, user-defined issue hierarchy\n\nStructure Gantt\nVisualize dependencies and timelines across large-scale projects with an adaptable, easy-to-use Gantt chart solution for Jira\n\nStructure Testy\nLightweight testing extension for Structure\n\nAutomation\nAutomation for Jira - the simple way to automate & extend Jira. All power, no scripts\n\nAutoblock\nCode less. Build more. Jira Automation for all\n\nScriptRunner\nTransform your Jira with the complete Automation, Customisation and Extension solution\n\nJira Misc Custom Fields\nDisplay information based on computed values - help Jira users stay on top of projects with JMCF’s calculated custom fields","attendees":["omarquet@xebia.fr"]},{"id":"5m3q00ld8fip4l7pk6165ac4ic","startTime":"2019-10-07T15:05:00","endTime":"2019-10-07T15:30:00","summary":"Formal - [XebiCon] Nos secrets pour piloter un projet data science","description":"**Pitch**\nLa Data Science agile... Tester, se planter, apprendre, tester à nouveau, obtenir des petites réussites puis recommencer... Voici une partie de mon quotidien depuis 3 ans. \n\nJe vais vous partager quelques pratiques pour construire un produit Data Science. Les murs que nous avons pris, les mauvais apprentissages et maintenant comment nous faisons.\n\n**Niveau**\ndébutant","attendees":["ndufosse@xebia.fr","mclough@xebia.fr"]},{"id":"038ud521i52uukmnv4ev0gocq0","startTime":"2019-10-07T15:35:00","endTime":"2019-10-07T17:30:00","summary":"Hands-on Play JSON","description":"**Pitch**\n\nPrise en main et tous les cas utiles dans une application Web ou dans un micro-service. Après ça, vous abandonnerez les annotations...\n\n**Niveau**\n\nConnaître un peu Scala\n\n**Prérequis**\n\n - Intellij avec plugin Scala ou autre IDE qui gère Scala 2.12\n - sbt (à installer selon un des moyens fourni par https://www.scala-sbt.org/download.html)\n - TODO : repo, sbt update, etc...","attendees":["jrousseau@xebia.fr"]},{"id":"1dd19cm7vp80n4pt5o5o7upuee","startTime":"2019-10-07T15:35:00","endTime":"2019-10-07T16:00:00","summary":"Formal - La confidentialité assurée par les math (DevFest Nantes et Xebicon19)","description":"Depuis mars dernier la famille TensorFlow compte un nouveau membre TensorFlow Privacy. De quoi s’agit-il ? Quelles sont les théories mathématiques qui garantissent la confidentialité d’un modèle de Deep Learning et comment sont-elles implémentées ?","attendees":["gbianchi@xebia.fr","dattali@xebia.fr"]},{"id":"3oqmg8q28c7f38roqjndqfb10p","startTime":"2019-10-07T15:35:00","endTime":"2019-10-07T17:30:00","summary":"Atelier - Rétro Leviosa ! Build our Harry Potter retro !","description":"**Pitch**\n\nOyé oyé sorcières, sorciers, gnômes et bidules bizarres qui ressemblent à rien ... Venez inventer avec nous un format de rétrospective sur la Thématique de Harry Potter.\n\nAu menu : Plus de 40 visuels d'une graphiste sur l'oeuvre de Rowling pour créer la rétro qui déchire !  \n\nEnsemble : \n10 min : concept et présentation des briques\n\nPar groupe : \n5 min : choix des briques\n20 min : idéation individuelle\n10 min : présentation et decision collective\n15 min : prototypage retro collectif\n\nEnsemble \n30 min : rétro de l'atelier sur les protos des autres \n20 min : présentation rétro + feedbacks\n\n**Niveau**\n\nNeed techs & coachs ! Parceque j'aime avoir des copains !\n \n\n**Pré-requis**\n\nPréférez Star Wars (parceque les ewoks ... Ca fume Dobby en 2-2)","attendees":["dattali@xebia.fr","gmathieu@xebia.fr","rtemim@xebia.fr","abrebant@xebia.fr"]},{"id":"5q2fftkviesug7241tojqsvklu","startTime":"2019-10-07T15:35:00","endTime":"2019-10-07T17:30:00","summary":"Hands-on - Speaker AWS - Sébastien Stormack - Workshop Amplify","description":"\nSpeaker: Sébastien Stormack - Dev Evangelist France\n### Pitch\n\nDans cet atelier, nous utiliserons React pour créer une application Web pilotée par les données permettant aux utilisateurs de télécharger des photos pour sécuriser leurs galeries de photos. Nous utiliserons AWS AppSync pour être rapidement opérationnel avec une API GraphQL qui sauvegarde nos données dans Amazon DynamoDB. En outre, nous montrerons comment utiliser la bibliothèque AWS Amplify pour authentifier les utilisateurs, communiquer avec notre API et gérer les téléchargements de photos. Enfin, nous ajoutons un marquage d'objet basé sur l'IA à l'aide d'Amazon Rekognition.\n\n### Niveau\n\nIntermédiaire\n \n### Pré-requis\n\nLes comptes pour se connecter seront fournis.\n\n### Informations","attendees":["akinsella@xebia.fr"]},{"id":"1sqs5hg7cp2v579fhqrhii1trj","startTime":"2019-10-07T16:05:00","endTime":"2019-10-07T16:30:00","summary":"Formal - [Xebicon]Time Series Made Easy !","description":"La prévision des séries temporelles est un domaine de la data science présent au cœur de nombreuses activités d'entreprise. Cependant, il s’agit d’un territoire souvent inexploré en raison de sa complexité: utiliser et optimiser les modèles classiques de prédiction temporelle nécessite en effet une connaissance approfondie de leurs rouages mathématiques.\nAujourd'hui, il existe des outils pour travailler rapidement avec des times series d’une façon plus facile et pragmatique à l'instar de Prophet de Facebook, GluonTs d’Amazon et Amazon forecasting de AWS.\n\nVenez découvrir ces outils et les prédictions rapides et de qualité qu’ils permettent !","attendees":["vvillet@xebia.fr","sbenfredj@xebia.fr"]},{"id":"37aucogvm2qj6mmr6uqe9c62g1","startTime":"2019-10-07T16:35:00","endTime":"2019-10-07T17:00:00","summary":"Formal - [XebiCon] Management @ Xebia : REX People Centric","description":"**Pitch**\n \nRetour sur l'implémentation du management chez Xebia. Les contraintes, les outils, les réussites et les échecs.\n\nLe manageur est un mot qui fait peur, synonyme d'ascension professionnelle, venez découvrir comment chez Xebia nous avons réinventé le rôle pour en faire un sujet épanouissant, au service de l'autre.\n \n**Niveau**\n \n🌶️\n\n#craft","attendees":["blacroix@xebia.fr","jsmadja@xebia.fr"]},{"id":"5rqvbckc1sg629c98ohnnnnh8r","startTime":"2019-10-07T17:05:00","endTime":"2019-10-07T17:30:00","summary":"Formal - Détails sur les deux grands Garbage Collectors Java (CMS et G1GC).","description":"Lors de mon dernier slot \"Devoir de mémoire\" en Septembre, j'ai manqué de temps pour détailler le fonctionnement du CMS et du G1GC Java.\n\nEtant donné que de la place s'est libéré, j'en profite pour vous proposer de consacrer 30 minutes *uniquement* sur le fonctionnement de ces deux Garbage Collectors, qui dominent le monde Java actuellement.\n\nIl n'y a pas forcément besoin d'avoir suivi le slot de Septembre : je ferai un rappel suffisant pour suivre la présentation. Je vous décrirai, avec des schémas, le fonctionnement du CMS et du G1GC et ce qui les différencie, afin que vous ayez une meilleure conscience de ce qui se passe derrière vos lignes de code.\n\nLes développeurs y trouverons de meilleures connaissances pour améliorer leur code, les ops des informations pour faire un choix de GC et de tuning, les autres de la culture en plus.","attendees":["csouchon@xebia.fr"]},{"id":"0484toaf5l20ci0preeg2o6jsi","startTime":"2019-10-07T17:35:00","endTime":"2019-10-07T18:30:00","summary":"Mentoring - Container Summer School","description":"**Pitch**\nCe slot est une session du \"mentoring\" sur les Conteneurs : la Container ~Summer~ School.\nLes participants sont déjà connus et ce slot est la 4e occurence d'une session hebdomadaire de formation conteneurs interne. Pour plus d'infos, voir le mail \"Container (Summer ?) School\". Si vous souhaitez venir, la porte sera ouverte, mais attendez vous à arriver en plein milieu d'une suite de sujets !\n\n**Niveau**\nDébutant/intermédiaire\n\n**Pré-requis**\nFaire partie des participants à la Container ~~Summer~~ School ou accepter de venir en observateur en cours de route :)","attendees":[]},{"id":"3g5aa66kfjvkptus93qrem1uc4","startTime":"2019-10-07T17:35:00","endTime":"2019-10-07T18:30:00","summary":"Fondation Web","description":"","attendees":[]},{"id":"3ibob8l0dkp7m8p979oo7j3djv","startTime":"2019-10-07T17:35:00","endTime":"2019-10-07T18:30:00","summary":"Fondation Agile","description":"","attendees":[]},{"id":"3r1ebkp34b42lstjpmj8n10g2q","startTime":"2019-10-07T17:35:00","endTime":"2019-10-07T20:00:00","summary":"After XKE et partage","description":"","attendees":[]}]