[{"id":"3g6gt4qermn1ro7b9jh3qhdj4e","startTime":"2019-02-11T09:00:00","endTime":"2019-02-11T19:00:00","summary":"XKE","description":"","attendees":[]},{"id":"6vh4sd6gfee709ulf0lih2lt0o","startTime":"2019-02-11T09:30:00","endTime":"2019-02-11T10:00:00","summary":"Plénière","description":"**Pitch**\n2 mois après le rachat, l'objectif de ce slot est de vous présenter toutes les actions menées, les discussions entamées, les chantiers accomplis dans le cadre de l'intégration Xebia/P.S\nUn temps conséquent sera dédié à vos questions en Live\n\n**Niveau**\nN/A\n\n**Pré-requis**\nN/A\n\n**Logistique**\nMicro","attendees":["jsmadja@xebia.fr","tcavin@xebia.fr","cheubes@xebia.fr"]},{"id":"03agle9bap1q9ubc56soi178d2","startTime":"2019-02-11T10:05:00","endTime":"2019-02-11T11:00:00","summary":"Atelier - Définition des valeurs d'une équipe","description":"**Pitch**\nVous vous souvenez de la Bérézina de l'équipe de France de football en 2010 ? Comment en partant de là on peut arriver à une victoire en 2018 ? Peut être avons nous un début de réponse. \nApprenez à animer un atelier pour définir les valeurs et la charte d'une équipe.\n\n**Niveau**\nDébutant\n\n**Pré-requis**\nAvoir des convictions\n\n**Logistique**\n1 tableau blanc par équipe de 6, des marqueurs + post-it","attendees":["jbrambor@xebia.fr","bdepompignan@xebia.fr"]},{"id":"3t7rk9ocacsjcqia0ooi2qk00a","startTime":"2019-02-11T10:05:00","endTime":"2019-02-11T10:30:00","summary":"Demo/Formal - Enforcing your architecture decisions with ArchUnit","description":"** Il s'agit d'une répét pour les confs Devoxx, etc. **\n\n**Pitch**\nQu'elles soient prises par des comités d'architectes ou par les équipes directement en contact avec le code, le suivi des décisions d'architecture est souvent problématique. Pour des contextes Java, ArchUnit propose une solution par la formalisation de ces décisions sous la forme de tests intégrés à l'application.\nCette présentation vous donnera les éléments pour décider de la pertinence d'ArchUnit dans votre contexte et pour l'y mettre en place en toute simplicité.\n\nAgenda :\n1 . Demo\n2 . Use cases\n3 . IRL\n4 . Feedback\n\n**Niveau**\nTous niveaux\n\n**Pré-requis**\nConnaissance basique de Java\n\n**Logistique**\nVidéoprojecteur","attendees":["bdupin@xebia.fr","sdecout@xebia.fr"]},{"id":"4eeu22kot2tiiooiin8ghd04u7","startTime":"2019-02-11T10:05:00","endTime":"2019-02-11T11:00:00","summary":"Declaring War On Imbalanced Data","description":"How to handle imbalanced data in a data science project \n\nExploring different approaches that handles imbalanced data and comparing them.\n\nExplaining in details SMOTE method to balance and oversample the training dataset.\n\nSome helpful guide lines, recommendations and tips will be discussed at the end of the slot.","attendees":["hbachar@xebia.fr"]},{"id":"4qqc7jchbstm4mupimqi88qibu","startTime":"2019-02-11T10:05:00","endTime":"2019-02-11T11:00:00","summary":"Bien tester votre code Spark","description":"**Pitch**\n \nPendant 1h je vous présenterai comment bien tester son code spark, du petit test unitaire au test de bout en bout. \n\nCe slot est un des chapitres de la nouvelle formation \"Spark Avancé\" que nous donnons avec Romain le lendemain.\n \n**Niveau**\n \nMoyen\n \n**Pré-requis**\n  \n**Logistique**\n \n-","attendees":["aphelip@xebia.fr"]},{"id":"5706f7ksrg0g0gesd35g97r9id","startTime":"2019-02-11T10:35:00","endTime":"2019-02-11T11:00:00","summary":"Experimental icebreaker","description":"**Pitch :**\n\nJe vous propose d’utiliser les kanjis dans un atelier expérimental afin de comprendre comment nous réagissons au rationnel et à l’émotionnel.\nL’atelier pourra prendre au maximum 20 personnes.\n\n**Prérequis :** ne pas savoir lire les kanjis ou être familier avec ces écritures.","attendees":["ndufosse@xebia.fr"]},{"id":"3hm6nnh5aua10qq9h28e6icnj3","startTime":"2019-02-11T11:05:00","endTime":"2019-02-11T13:00:00","summary":"Formal Hands-on - Clojure Persistence","description":"**Pitch**\n \nClojure est un langage de programmation fonctionnel compilé, multi-plateforme et destiné à la création de programmes sûrs et facilement distribuables.\nDans une série de XKEs nous allons apprendre le minimum de ce language \n et le tooling associé pour pouvoir construire une application web avec des données persistées.\n\nCe slot est dédié à la persistence avec Datomic\n \n**Niveau**\n \nintermediaire\n \n**Pré-requis**\n \nJava ...\n \n**Logistique**","attendees":["ponneby@xebia.fr"]},{"id":"3vus2ns868tr483ctvat2l2gh9","startTime":"2019-02-11T11:05:00","endTime":"2019-02-11T11:30:00","summary":"AI in the cloud : using AWS SageMaker in real life","description":"L’intelligence artificielle est devenue un enjeu majeur pour les différents providers du cloud, et AWS n’y fait pas exception. La promesse d’AWS SageMaker est notamment de faciliter le développement et l’industrialisation des modèles de machine learning pour tous les développeurs, qu’ils soient Data Scientists ou non, quelque soit leur niveau de connaissances en la matière. \nDurant ce talk, nous vous montrerons comment utiliser cet outil pour mettre en place une application réelle qui utilise un modèle exporté, et vous ferons un retour d’expérience sur l’outil dans son ensemble.","attendees":["dortega@xebia.fr","ybenoit@xebia.fr"]},{"id":"78cu252hbub9ju22lt7vskn2me","startTime":"2019-02-11T11:05:00","endTime":"2019-02-11T13:00:00","summary":"Boost your BDD practice with the Example Mapping","description":"**Pitch**\nNombreux sont les projets où la collaboration entre technique et métier est difficile. Les experts métiers sont par définition très occupés tandis que les formats habituellement utilisés, que l'on pratique le BDD ou non, sont souvent longs, ennuyeux et peu structurés.\n\nVenez découvrir dans cet atelier une nouvelle manière de faire, collaborative, ludique et efficace. Nous prendrons un exemple de la vie concrète pour en dérouler les différentes étapes : la réservation d'un billet de train !\n\nNous travaillerons de manière collaborative en prenant le temps de la réflexion en fin de séance. \n\n_Note : _ Le BDD n'est qu'une manière d'aborder le sujet de l'Example Mapping. Le domaine d'application est bien plus large et touche la plupart des équipes agiles, quelque soit la méthodologie utilisée.\n\n**Niveau**\nAccessible à toutes et tous que l'on soit développeur, ADM, coach ou autre.\nLa pratique du BDD n'est pas un pré-requis.\n\n**Pré-requis**\nDes profils mixes seraient un grand plus !\n\n**Logistique**\nIdéalement une grande salle pour former des îlots de tables et pouvoir travailler sereinement.","attendees":["cheliou@xebia.fr"]},{"id":"2cmgrank1k31ab1i93ovt3sn8a","startTime":"2019-02-11T11:35:00","endTime":"2019-02-11T12:00:00","summary":"Demo - King of Whois","description":"**Pitch**\n\nEcrire des tests E2E est loin d'être une partie de plaisir 🤯\n\nC'est dû d'une part aux implémentations récentes des sites web bourrés de JS et d'animations mais aussi à la nature \"indéterministe\" du contenu HTML à tester 🙄\n\nPrenons l'exemple de XWhois : on a souvent de nouvelles têtes, le jeu balance les Xebians d'une façon aléatoire et Julien Smadja n'arrête pas de remettre à zéro le leaderboard pour le grand malheur des top gamers 😞\n\nUniquement dans un but de recherche scientifique 🔬  je me suis lancé le défi d'être le superplayer de XWhois et battre le record de tous les temps en utilisant des tests E2E réalisés avec **Cypress** 😬\n\nCes tests ont pour principal objectif d'être le moins fragiles possible, quand Julien remettra à zéro les scores, on doit être capable de rejouer les tests pour redevenir the King of Whois sans la moindre modification du code 🥳\n\nSi vous êtes plutôt des ~~petits malins~~ personnes honnêtes, venez assister à ce slot dans lequel je battrai le niveau Extrême en live à la fin de session 🎮\n\n**Niveau**\nDébutant\n\n**Logistique**\nVidéoprojecteur","attendees":["ftirich@xebia.fr"]},{"id":"2cft5svg3q9vigokqfs3jnsr8q","startTime":"2019-02-11T12:05:00","endTime":"2019-02-11T13:00:00","summary":"Web performance: Optimisons ensemble le site de Xebia","description":"**Pitch**\n \nLe site xebia.fr obtient un score de vitesse de 37/100 sur l'outil PageSpeed Insights développée par Google.\n\nComprenons et optimisons ensemble ses performances.\n\nAu sommaire :\n- Pourquoi est-ce important d'optimiser les performances de son site\n- Optimiser le temps de build\n- Quelques astuces concernant les perfs sur l'inspecteur d'élément de Chrome\n- Améliorer le First Contentful Paint\n- Différer les ressources\n- Préfetcher les ressources au moment opportun\n- Des images \"nouvelles générations\"\n\n**Niveau**\n \ndébutant\n \n**Pré-requis**\n \n/\n \n**Logistique**\n Vidéo-Projecteur","attendees":["jdasilva@xebia.fr"]},{"id":"733ok4hgpldclrtp2aedekn97b","startTime":"2019-02-11T12:05:00","endTime":"2019-02-11T13:00:00","summary":"TensorFlow toujours plus haut","description":"**Pitch**\n \nTensorFlow, malgré sa grande popularité, a souvent été perçu comme un framework relativement bas niveau pour le Deep Learning, et compliqué à appréhender et débogguer notamment avec son concept de graphe. Mais c'est maintenant de l'histoire ancienne grâce à ses récentes APIs haut niveau.\nNous allons parcourir ensemble ces APIs haut niveau que sont tf.data, tf.keras, les Estimators ainsi que le mode d'exécution impératif (eager mode), et vous verrez que vous ne pourrez plus vous en passer !\n \n**Niveau**\n \nmoyen\n \n**Pré-requis**\n \nRAS\n \n**Logistique**\n \nRAS","attendees":["ybenoit@xebia.fr"]},{"id":"7b8r4d18lnvbfpu9cvj011b63n","startTime":"2019-02-11T13:05:00","endTime":"2019-02-11T14:00:00","summary":"Déjeuner","description":"- lasagnes bolognaises (+ saumon & végétarienne pour les intolérants à la viande)\n- crumble aux pommes","attendees":[]},{"id":"5hsufl68afalcpc981ddevhhnv","startTime":"2019-02-11T14:05:00","endTime":"2019-02-11T14:30:00","summary":"Newcomers","description":"1 - Vincent\n2 - Alexandre\n3 - Cecile\n4 - Soufiane\n5 - Adele","attendees":["agenet@xebia.fr","varrocena@xebia.fr","akiener@xebia.fr","cdreyfus@xebia.fr","selalami@xebia.fr"]},{"id":"64o3aohj6ph3cbb1c4smcb9k65j62b9pcgr32b9nc8qj6p34cgs3aohj60","startTime":"2019-02-11T14:35:00","endTime":"2019-02-11T15:00:00","summary":"Plénières éclair : XQrcode, Mois du SM, TO & Xebicon 19","description":"","attendees":["tchampion@xebia.fr","scivetta@xebia.fr","abrebant@xebia.fr"]},{"id":"2101ig4f6r6hokjgor4dpdq2an","startTime":"2019-02-11T15:05:00","endTime":"2019-02-11T15:30:00","summary":"Plénière - Studio 2018","description":"","attendees":["lperot@xebia.fr"]},{"id":"2i6tjfebg312fhmo8t71le8nrv","startTime":"2019-02-11T15:35:00","endTime":"2019-02-11T16:00:00","summary":"Kotlin <3 Ktor","description":"__Pitch__\nLe succès de Kotlin n'est plus à démontrer, Google le promeut sur Android et sur son Cloud, son créateur JetBrains en parle dans les conférences et Gradle l'utilise pour configurer ses projets. \n\nDu côté des frameworks web Spring Boot à rapidement supporté Kotlin ce qui a aussi contribué à son adoption dans le milieu des développeurs Java. En parallèles des micro frameworks web ont vu le jour directement développé en Kotlin et c'est le cas de Ktor qui propose pleins de fonctionnalités pour développer son serveur web en tirant profit des fonctionnalités du langage (DSL, extensions, etc.).\n\nDécouvrons ensemble ce framework pleins de promesses, simple à utiliser et qui rassemble une grande communauté.\n\n__Niveau__\ndébutant\n\n__Pré-requis__\nConnaitre Kotlin ou Java\n\n__Logistique__\nVidéoprojecteur","attendees":["pgdejardin@xebia.fr"]},{"id":"32ht1us7kcq4uk0tqu7ontl7hq","startTime":"2019-02-11T15:35:00","endTime":"2019-02-11T16:00:00","summary":"React, l'âge de Reason","description":"__Pitch__\nAprès TypeScript, Flow et Elm, venez découvrir Reason ! Nouveau langage développé par Facebook, Reason est multi-paradigme (mais plutôt fonctionnel) et se base sur OCaml avec une bibliothèque officielle de binding vers React. \n\nAu travers d'exemples, nous verrons ensemble les principaux bénéfices du langage, ses particularités, ses outils et son intégration avec React.\n\n__Niveau__\nexpert\n\n__Pré-requis__\nConnaître React est mieux\n\n__Logistique__\nslot peut être filmé","attendees":["aletaxin@xebia.fr"]},{"id":"6af1dovs1onpi48v37nb60p22s","startTime":"2019-02-11T15:35:00","endTime":"2019-02-11T16:30:00","summary":"Teste tes connaissances de scrum from the guide","description":"\n**Pitch**\n\nViens tester, en jouant, tes connaissances de la dernière mise à jour du scrum guide. Attention, terrain miné ! ;)\n2 slots de 30 min :\nPremier slot : amateur\nDeuxième slot : pro\n\n2 vainqueurs, 2 cadeaux !\n \n**Niveau**\nDébutant (avoir lu le scrum guide 1 fois, 1 jour ou pas :) )\n \n**Pré-requis**\n Avoir lu le scrum guide 1 fois (ou en tout cas un vernis de connaissances suffisant pour jouer)\n \n**Logistique**\n 1 projecteur ","attendees":["meckert@xebia.fr","iroques@xebia.fr"]},{"id":"703gs9u79b6a4s9gmotpr7vq6o","startTime":"2019-02-11T15:35:00","endTime":"2019-02-11T16:30:00","summary":"BERT, nouvel état de l'art pour le NLP ?","description":"**Pitch**\nPrésentation du framework BERT ou Bidirectional Encoder Representations from Transformers. C’est une nouvelle méthode de NLP développée par Google pour pré-entraîner des représentations du langage et qui donne d’excellents résultats sur de nombreuses tâches NLP (eg : question answering, language inference).\n\nTalk de Guillaume Desbuquois, Data Scientist PS.\n\n**Niveau**\nIntermédiaire\n\n**Pré-requis**\nUne connaissance minimale du NLP est un plus pour apprécier la présentation\n\n**Logistique**\nPrésence d'un PS validée","attendees":["guillaume.desbuquois@publicis.sapient.com"]},{"id":"19cg5e0d11u1s40eqguuj9mgdd","startTime":"2019-02-11T16:05:00","endTime":"2019-02-11T17:00:00","summary":"React : les hooks","description":"__Pitch__\nIls arrivent bientôt, ils vont vous changer la vie, ce sont les Hooks. Annoncé en grande pompe lors de la dernière React Conf, ils promettent entre autre :\n  - D'écrire plus de composants sans faire de classes\n  - De mutualiser les logiques de states entre composants\n  - De réduire le wrapper hell\n\nVenez découvrir ce qu'ils apportent, on parie que vous allez accrocher :)\n\n__Niveau__\nExpert\n\n__Pré-requis__\nAvoir une expérience avec React\n\n__Logistique__\nSlot peut être filmé","attendees":["sboeuf@xebia.fr","tsimonnet@xebia.fr"]},{"id":"2728utjm0adr35rfda17pc5c10","startTime":"2019-02-11T16:05:00","endTime":"2019-02-11T17:30:00","summary":"Commerce : vente & REX d'un cadrage FUSION chez Publicis Sapient","description":"**Pitch**\n P.S vient nous raconter le prequel du projet Galeries Lafayette. La promesse d'un cadre de leur offre \"Fusion\" et leur retour d'expérience en présence du Delivery Lead Manager .\n\n**Niveau** Débutant \n **Pré-requis**  Aucun \n **Logistique** Ne pas filmer","attendees":["flaurain@xebia.fr"]},{"id":"151h6ijiiv7qef5c9891a2n7ec","startTime":"2019-02-11T16:35:00","endTime":"2019-02-11T17:30:00","summary":"TALK ALPHA CONF 2019 -Dynamique de Groupe et Cohésion selon la théorie organisationnelle de Berne - Petit Guide de Survie pour Leader Jedi","description":"**Mon nouveau sujet de conférence 2019 en version ALPHA à tester en famille**.\n\n1 heure de talk prévue.\nTous niveaux bienvenus, aucune expertise requise.\nAnalyse Transactionnelle à l'échelle / Leadership / Cohésion de groupe\n\n**Le pitch pour les CFP 2019**\n\n*L’analyse transactionnelle organisationnelle est rarement vulgarisée et rendue accessible. Pourtant, elle offre des trésors et de nombreuses clefs de compréhension pour tous les managers, collaborateurs et facilitateurs. Parce qu’elle s’intéresse à la relation entre les individus, elle complète formidablement l’agilité et répond à ses valeurs, par delà les méthodes. Dans le cadre de ce sujet « Dynamique de Groupe et Cohésion », nous nous intéresserons au groupe. Qu’est ce qu’est-ce qu’un groupe, en quoi se distingue-t-il d’une masse ou d’une foule, quelle nuance avec une organisation, et quels sont les processus relationnels qui s’activent sur ses frontières, entre pression et agitation qui sous tendent la gestion de différentes énergies ? Nous pourrons alors aborder le sujet du leadership et ses fonctions d’appareil pour permettre de traiter le sujet de la cohésion. Comprendre ce qu’est la cohésion de groupe, ce qui la crée mais aussi la détruit : du bouc-émissaire, en passant par le secret, la loyauté, la confiance, l’engagement ; de l’erreur à la trahison, autant de configurations possibles qui imposent de comprendre comment se déroule la gestion des flux d’énergie individuels et collectifs. Comprendre pour enfin donner des clefs, à tout leader,  manager ou encore facilitateur qui souhaitent agir sur ce champ de forces à l’oeuvre. En chacun de nous sommeille un maitre Jedi. Et si l’analyse transactionnelle pouvait vous sauver du côté obscur?  \"Un objet ne peut pas vous rendre bon ou mauvais. Seule la tentation du pouvoir de la connaissance interdite ou même le simple désir de faire du bien peuvent conduire vers ce chemin. Mais seulement vous pouvez en changer.\" - Bendu, La Guerre des Etoiles*.","attendees":["asgirault@xebia.fr"]},{"id":"2lf9h204pcpfis2s36pq6eiivv","startTime":"2019-02-11T16:35:00","endTime":"2019-02-11T17:30:00","summary":"GCP pour les Data Scientists","description":"**Pitch**\n \nDepuis son arrivée, GCP a démocratisé la conception et la mise en place de services basés sur l'IA sans avoir besoin en pré-requis de connaissances spécifiques en IA, Google Cloud AutoML étant le projet phare de cette tendance. Toutefois GCP met à disposition des services intéressants pour un Data Scientist tels que ML Engine pour entrainer et déployer ses propres modèles. Comment un Data Scientist peut-il s'orienter dans ce monde qui n'est pas le sien pour exploiter tout le potentiel de GCP ?\n \n**Niveau**\n \nmoyen\n \n**Pré-requis**\n \nNone\n\n**Logistique**\nProjecteur","attendees":["gbianchi@xebia.fr"]},{"id":"0h0j0ibrji9275jula377iogld","startTime":"2019-02-11T17:35:00","endTime":"2019-02-11T18:30:00","summary":"Atelier Revue de Presse","description":"Créneau de partage pour présenter et préparer la prochaine Revue de Presse","attendees":["sbuisson@xebia.fr"]},{"id":"1afhs3b0dd7610bif25aj70hmf","startTime":"2019-02-11T17:35:00","endTime":"2019-02-11T18:30:00","summary":"Fondation data","description":"Point Mercato et séance de questions/réponses avec Raphaëlle Abitbol sur la data chez P.S","attendees":["cjulien@xebia.fr","ybenoit@xebia.fr","aphelip@xebia.fr"]},{"id":"3oqd8fjfk3q0etngvvbk0hinim","startTime":"2019-02-11T17:35:00","endTime":"2019-02-11T18:30:00","summary":"X-helping","description":"","attendees":["ndufosse@xebia.fr"]},{"id":"5i9hghnlo56rgbavei44io11kt","startTime":"2019-02-11T17:35:00","endTime":"2019-02-11T18:30:00","summary":"Partage","description":"","attendees":[]},{"id":"64q3cdr56opj8b9j71ij2b9k6koj4bb174ojcb9n6so38p9l71i32e3564","startTime":"2019-02-11T17:35:00","endTime":"2019-02-11T18:30:00","summary":"Organisation DataXDay","description":"","attendees":[]},{"id":"2pf2uk303bq1q68pdtcjoafoa1","startTime":"2019-02-11T18:30:00","endTime":"2019-02-11T20:00:00","summary":"After XKE et Feedback global","description":"","attendees":[]}]