[{"id":"7bp2ou9pp0ta6qqnreppknb19b","startTime":"2018-09-10T07:00:00","endTime":"2018-09-10T17:00:00","summary":"XKE","description":"","attendees":[]},{"id":"78q9c01v2dbr2rmugiunmf1abc","startTime":"2018-09-10T07:30:00","endTime":"2018-09-10T08:00:00","summary":"Plénière - La review 360","description":"Présenter la démarche de la review 360 et le pourquoi.\nPrésenter une première implémentation qui sera effectuée au mois de Septembre","attendees":["dpodyachiy@xebia.fr","njozwiak@xebia.fr"]},{"id":"23utod7nhf2hob65hfetskt2cg","startTime":"2018-09-10T08:05:00","endTime":"2018-09-10T10:00:00","summary":"Hands-on - IA avec AWS","description":"**Pitch**\nSession proposée par Maxime Thomas, Solutions Architect chez AWS.\nL'objectif est de découvrir SageMaker, la solution d'AWS pour faire de l'IA.\nContenu de la session : \n- Compréhension du service\n- Création d'une instance SageMaker\n- Utilisation de la version SageMaker de XGBoost\n- Entraînement distribué avec TensorFlow, via le SDK Python de SageMaker\n- Classification d'images avec un modèle ResNet, à entraîner from scratch ou via du Transfer Learning\n \n**Niveau**\nMoyen, une connaissance des algorithmes de ML ou une connaissance d'AWS est un plus\n \n**Pré-requis**\nAvoir un compte AWS Xebia\n \n**Logistique**\nAmener sa machine, non filmé, Xebians uniquement (pas de client)","attendees":["ybenoit@xebia.fr","maxthom@amazon.fr"]},{"id":"3154q615it6dn4fr7lr3c7ontn","startTime":"2018-09-10T08:05:00","endTime":"2018-09-10T09:00:00","summary":"Formal - (CONFLUENT.IO) Monitor Kafka like a Pro","description":"**Pitch**\n \nIn this talk, Kafka expert Florent Ramiere will share best practices for monitoring Kafka and the streams of events flowing through it. How to detect duplicates, catch buggy clients, and triage performance issues — in short, how to keep the business’s central nervous system healthy and humming along, all like a Kafka pro. \n \n**Niveau**\n \n**Pré-requis**\n \n\n**Logistique**\nProjecteur\n ","attendees":["flaurain@xebia.fr","florent@confluent.io"]},{"id":"5p8b2f9s9230lqsi5c86d4gve1","startTime":"2018-09-10T08:05:00","endTime":"2018-09-10T09:00:00","summary":"Demo/Formal - Introduction à ArchUnit","description":"**Pitch**\nQu'elles soient prises par des comités d'architectes ou par les équipes directement en contact avec le code, le suivi des décisions d'architecture est souvent problématique. Pour des contextes Java, ArchUnit propose une solution par la formalisation de ces décisions sous la forme de tests intégrés à l'application.\nCette présentation vous donnera les éléments pour décider de la pertinence d'ArchUnit dans votre contexte et pour l'y mettre en place en toute simplicité.\n\nAgenda :\n1 . Demo\n2 . Use cases\n3 . IRL\n4 . Feedback\n\n**Niveau**\nTous niveaux\n\n**Pré-requis**\nConnaissance basique de Java\n\n**Logistique**\nVidéoprojecteur","attendees":["sdecout@xebia.fr"]},{"id":"4mbi4cun8f690reb81qb5j97lf","startTime":"2018-09-10T09:05:00","endTime":"2018-09-10T10:00:00","summary":"Formal - Retour sur une implémentation de HyperLedger Fabric","description":"**Pitch**\n\nJe propose un retour d’expérience sur la mise en place d'un POC d'Hyperledger Fabric en prenant comme base de réflexion le Use Case qui nous a été proposé par Europ-Assistance et pouvoir en parler dans un cadre qui n'est pas lié à de la crypto-monnaie.\n\nSujet abordé : \n- Le fonctionnement général de la technologie blockchain et la présentation d'Hyperledger Fabric\n- La façon dont j'ai crée le POC répondant au Use Case\n- Les difficultés que j'ai rencontré et comment je les ai résolu (ou pas)\n- Mon avis sur l'application de la blockchain dans le Use Case d'Europ-Assistance et plus généralement les critères qui font que la blockchain puisse être intéressant ou non sur un projet donné.\n \n**Niveau**\n \nTout niveau\n \n**Pré-requis**\n \nRien\n \n**Logistique**\n \nAucune préparation spécifique, juste un retro pour les slide","attendees":["vsegouin@xebia.fr"]},{"id":"7ct017uqvrrbc3fllfdsk2fmus","startTime":"2018-09-10T09:05:00","endTime":"2018-09-10T10:00:00","summary":"Hands on - Introduction à RasaNLU","description":"**Pitch**\nDécouverte de RasaNLU, l'alternative self-hosted a DialogFlow.\nUne petite présentation des fonctionnalités et la création d'un chatbot minimaliste seront au programme.\n\nPlanning :\n1 . Installer RasaNLU\n2 . Créer son premier model\n3 . Mettre a jour le model\n4 . Test du bot\n5 . Conclusion\n\n\n**Niveau**\nPeu importe\n\n**Pré-requis**\nInstaller Docker\nCloner le repo du slot\n\n**Logistique**\nVidéoprojecteur","attendees":["jmoulay@xebia.fr"]},{"id":"0eru670uean6oaritqgp7sq8lg","startTime":"2018-09-10T10:05:00","endTime":"2018-09-10T10:30:00","summary":"Live coding - Codepush","description":"","attendees":["hjumeau@xebia.fr"]},{"id":"4568vrrk3f3eo1ci8cjbf68t34","startTime":"2018-09-10T10:05:00","endTime":"2018-09-10T10:30:00","summary":"Formal - reconnaissance de visages sur DeepLens","description":"**Pitch**\n Session proposée par Maxime Thomas, Solutions Architect chez AWS.\n\nDémonstration de reconnaissance de visages sur des modèles \"at edge\" sur la Amazon DeepLens.\n \n**Niveau**\nDébutant\n \n**Pré-requis**\n Aucun\n \n**Logistique**\nAucun, non filmé, Xebians uniquement","attendees":["ybenoit@xebia.fr","maxthom@amazon.fr"]},{"id":"c5h36db26cr36b9jcph62b9kckq6cb9p6ksjab9g61h3cchp70p34e1k6k","startTime":"2018-09-10T10:35:00","endTime":"2018-09-10T11:30:00","summary":"Déjeuner","description":"2 mini fougasses par personnes\n\n1 grande salade par personne :\n-Pâtes, légumes grillés, tomates, féta et olives,\n-Salade courgettes grillées, tomates et saumon frais,\n-Salade crudités et thon,\n-Pâtes, poulet, tomates, basilic, mozzarela\n\nAssortiment de desserts","attendees":[]},{"id":"3mgdb7o51k435kco29nsg8o20t","startTime":"2018-09-10T11:35:00","endTime":"2018-09-10T12:00:00","summary":"New Comers","description":"","attendees":["mohayon@xebia.fr","bbonnet@xebia.fr","jjouanne@xebia.fr","gmathieu@xebia.fr","nlaille@xebia.fr","karchet@xebia.fr","mpichou@xebia.fr"]},{"id":"0brjcj8bs1hvo2b85iobmt9se2","startTime":"2018-09-10T12:05:00","endTime":"2018-09-10T13:30:00","summary":"Formal - Une démarche d'accompagnement et des modèles","description":"**Pitch**\nJe propose de présenter une démarche d'accompagnement, du 1er rdv d'avant-vente avec le client jusqu'à la clôture de la mission. Objectifs du slot :\n1. Partager une démarche d’accompagnement et des modèles\n2. Échanger plus précisément sur le contrat de coaching\n\n**Niveau :** Néant\n\n**Pré-requis :** Néant\n\n**Logistique :** Un slot l'après-midi pour les coaches","attendees":["fcourdier@xebia.fr"]},{"id":"171v13jt16sqgjetibgn5bjbjp","startTime":"2018-09-10T12:05:00","endTime":"2018-09-10T12:35:00","summary":"Formal + Démos : Maven ♡ Docker","description":"**Pitch**\n\nGrâce au plugin `docker-maven-plugin` (https://dmp.fabric8.io/), simplifiez vos tests d'intégration grâce à Docker, mais aussi le build et push de vos images applicatives.\n\n**Niveau**\n\nDébutant - connaître Maven et Docker\n\n**Pré-requis**\n\nAucun\n\n**Logistique**\n\nPas filmé","attendees":["jnorblin@xebia.fr"]},{"id":"3a2t8h879feih99f97gsu7hane","startTime":"2018-09-10T12:05:00","endTime":"2018-09-10T13:30:00","summary":"Formal - Dialogflow : comment j'ai délégué la gestion des accès de la DGX Station à un chatbot","description":"**Pitch**\nCe slot se veut être une introduction à Dialogflow et ses concepts tout en étant un retour d'expérience concrêt sur ce que j'ai réalisé avec dans le cadre de la gestion d'accès à la DGX Station.\n\nVous ne connaissez pas Dialogflow ? C'est pour vous ! Vous connaissez Dialogflow mais vous demandez comment gérer la lifetime de vos contextes ? C'est pour vous aussi ! Vous vous demander comment vous vous retrouvez avec votre clé SSH sur la DGX juste en discutant avec un bot sur Slack ? C'est par ici :)\n\n**Niveau**\n\nDébutant\n\n**Pré-requis**\n\nAucun\n\n**Logistique**\n\nAucun","attendees":["achotard@xebia.fr"]},{"id":"129k3ccf5p5gm8rf72itq05ksc","startTime":"2018-09-10T12:35:00","endTime":"2018-09-10T13:30:00","summary":"Formal - Deep Learning & Augmented Reality : Face Recognition on a mobile app","description":"**Pitch**\nNous avons combiné Deep Learning et Réalité Augmentée dans une application iOS pour de la reconnaissance faciale. \n\nVous découvrirez dans cette présentation le type d'architecture de réseau de neurones utilisé pour faire cette reconnaissance sans avoir besoin de centaines de photos de chaque personne, ainsi que l'utilisation de Core ML pour l'intégration de l'algorithme à une application iOS, et enfin l'incorporation d'une brique de Réalité Augmentée pour afficher du contenu concernant la personne reconnue.\n\n**Niveau**\n\nDébutant\n\n**Pré-requis**\n\nAucun\n\n**Logistique**\n\nRien de particulier","attendees":["ybenoit@xebia.fr","scivetta@xebia.fr"]},{"id":"5pb1ipqhf5qn14t6kuh49v3jl0","startTime":"2018-09-10T12:35:00","endTime":"2018-09-10T13:30:00","summary":"Formal - Pourquoi les devs devraient s'intéresser aux OKR?","description":"**Pitch**\n\n\"Vous en avez marre des projets sans but qui partent dans tous les sens car le client ne sait pas ce qu'il veut ?\nVous en avez assez de ne pas savoir la valeur que vous apportez dans un projet \"d'envergure\" ?\n\nLes OKR (pour Objectives & Key Result\") sont peut-être la méthode qu'il vous faut !\nParce que ce sont ceux qui font qui savent et qu'il faut respecter l'expertise de chacun pour co-construire des produits qui ont du sens, je vous propose un petit REX de ma vie passée où j'ai mis en place les OKR avec des résultats intéressants.\nJe vous proposerai ensuite de mettre les mains dans le cambouis dans la seconde partie.\n\n**Niveau**\n\nToute personne qui a une activité opérationnelle dans la conception ou la réalisation de produits.\nPas de bagage technique nécessaire, juste une appétence pour faire des choses qui ont du sens ;)\n\n**Logistique**\n\nPlutôt l'après-midi pour que les piwies puissent éventuellement se joindre à nous ?\nJe ramènerai les templates et les post it\nUne douzaine de personnes pour que l'on puisse former des petits groupes de travail pour la seconde partie","attendees":["gmathieu@xebia.fr"]},{"id":"4q8nku0qdc1dhco848s9iq0ap0","startTime":"2018-09-10T13:35:00","endTime":"2018-09-10T15:30:00","summary":"Formal / Hands On : From Mobile first to AI first : Build your first Android application with ML Kit","description":"**Pitch**\n\nUne introduction sur comment les technologies du machine learning pour les applications mobiles évoluent ces derniers temps, suivi par un hands-on qui permet de construire une application Android avec ML Kit.\n\n**Niveau**\n\nDébutant\n\n**Pré-requis**\n\n- An account Google\n- A recent version of Android Studio (v3.0+)\n- A physical Android device\n- Basic knowledge of Android development in Java or Kotlin\n- Basic understanding of machine learning models\n\n**Logistique**","attendees":["qjin@xebia.fr"]},{"id":"7ab68j8qpc9vr2omvnbjfute3e","startTime":"2018-09-10T13:35:00","endTime":"2018-09-10T14:30:00","summary":"Formal - Les développeurs sont des cons","description":"**Pitch**\n\nTravailler entouré de développeurs n'est pas une sinécure tous les jours surtout si on est encore un peu junior et pas issu d'une formation scientifique.\n\nAlors voilà ce slot est dédié à tous les agilistes, les PO, les recruteur/euses, les commerciaux qui bossent au quotidien avec nous et qui pourtant paieraient cher pour avoir un traducteur français / dev et savoir comment manager ces équipes pas vraiment comme les autres.\n\n**Niveau**\n\nTout niveau mais orienté vers les personnes qui font autre chose que du code à Xebia\n\n**Pré-requis**\n\n\n\n**Logistique**\n\nAux orgas: il faudrait planifier ce slot parmi les créneaux de l'après-midi afin que les piwies puissent y assister vu qu'ils sont l'audience cible.","attendees":["dbaron@xebia.fr"]},{"id":"7u9409pd4520acufcmkso5hjsf","startTime":"2018-09-10T13:35:00","endTime":"2018-09-10T15:30:00","summary":"Formal + Hands On : A la découverte de Google Cloud Function","description":"**Pitch**\nQui sera la meilleure société de livraison par drone ?\nLearn & have fun en codant du serveless dans GCP ! Chaque équipe devra coder et déployer sa Cloud Functions pour répondre à des évènements (Pub/Sub ) de drones virtuelles et s'adapter pour gagner le plus de points. Un dashboard en temps réelle sera là pour rendre compte des déplaçements des drones sur la carte et des scores.\n\n**Niveau**\nDébutant\n\n**Pré-requis**\nNode.JS ou Python \n\n**Logistique**\nGoogle Chrome\nCréer un projet dans GCP Xebia (https://intranet-xebia.atlassian.net/wiki/spaces/XF/pages/75301976/How+To+-+Utiliser+le+compte+Google+Cloud+Platform+de+Xebia)","attendees":["aletaxin@xebia.fr","jbclaramonte@xebia.fr"]},{"id":"0244lf729dsmcj9nq4g5h32hig","startTime":"2018-09-10T14:35:00","endTime":"2018-09-10T15:30:00","summary":"Contest - Petit hack entre amis","description":"**Pitch**\nPetit hack entre amis: Découvrir et s'initier au Corporate Hacking à travers un jeu d'entreprise pour apprendre à transformer l'entreprise et le travail avec bienveillance.\n\nVous en avez marre du fonctionnement au ralenti de l’entreprise ? Vous en avez marre des réunions en cascade ? Vous trouvez qu’il est toujours compliqué d’entreprendre quoi que ce soit ? Vous trouvez que les projets sont trop longs, que les décisions sont toujours remises en cause ? Vous n’en pouvez plus du système hiérarchique descendant ? Et si on travaillait autrement ?! Découvrez et initiez-vous au Corporate Hacking !\n\n**Niveau :** Néant\n\n**Pré-requis :** Néant\n\n**Logistique :** 10 personnes maximum, un slot l'après-midi pour les coaches","attendees":["kcardoso@xebia.fr"]},{"id":"0pcmnu1ors8v05nlnbhsjevc4n","startTime":"2018-09-10T15:35:00","endTime":"2018-09-10T18:05:00","summary":"Créneau de partage et After XKE","description":"","attendees":[]}]