[{"id":"59n244j79o0ui36s5otd346ifr","startTime":"2019-11-05T09:00:00","endTime":"2019-11-05T19:00:00","summary":"XKE","description":"","attendees":[]},{"id":"73is8pm7iac2v56km21ohbpn4j","startTime":"2019-11-05T09:00:00","endTime":"2019-11-05T09:30:00","summary":"Petit déjeuner","description":"","attendees":[]},{"id":"0r0v2g6vvaffq3lrphnu5m9dl9","startTime":"2019-11-05T09:35:00","endTime":"2019-11-05T10:00:00","summary":"Plénière - Annonces pour 2020 / Point d'avancement sur la XebiCon","description":"Thibault nous fera des annonces concernant l'année 2020.\n\n-------------------------\nAnne : La XebiCon c'est le 28 novembre. Où en sommes-nous ?","attendees":["tcavin@xebia.fr","abeauchart@xebia.fr"]},{"id":"02repg4n512nno25sfhbn9t3e0","startTime":"2019-11-05T10:05:00","endTime":"2019-11-05T12:00:00","summary":"Hands-on - SwiftUI : React en natif","description":"**Pitch**\n\nVous avez entendu parler de SwiftUI ? C'est le nouveau framework Apple pour développer des interfaces iOS/macOS/**OS avec Swift en utilisant une syntaxe déclarative.\n\nLa simplicité de Swift, la puissance du déclaratif. Est-ce que l'outil est à même de rivaliser avec des technologies comme React ? Venez le décourvrir par vous-même dans ce hands-on ;)\n\nDisclaimer : ça va déchirer ! \n\n**Niveau**\n\ndébutant\n\n**Pré-requis**\n\nmacOS **Catalina**\nxcode 11","attendees":["pguzman@xebia.fr","jcpastant@xebia.fr"]},{"id":"06q9fe8624v84mvt6k5ps55cmt","startTime":"2019-11-05T10:05:00","endTime":"2019-11-05T11:00:00","summary":"Build and manage a Kafka Streams application via Github and Lenses.io ft Guillaume Ayamé","description":"Pitch: \nBuilding and deploying pipelines into production often takes weeks or even months due to complex operational requirements such as monitoring, security, governance, troubleshooting, auditing and deploying. Furthermore there is a lack of consistency in how applications are monitored, deployed and secured. Having worked in data analytics, I know we cannot afford to wait weeks for data to be ready in production. \n\nWhat I will show: How you can build pipelines with baked-in monitoring, security, governance and auditing with your existing Apache Kafka and Kubernetes in a consistent fashion. And have them managed in a GitOps-Style. \n\nPS: 🇫🇷Le talk est en Français.\n\nNiveau:\n- Entry-Level\n\nContraintes:\n- Speaker Guest\n- Demo avec wifi (prévoir un compte pour le wifi)","attendees":["ldivad@xebia.fr"]},{"id":"093ot9glrv99pglmm23okqivmq","startTime":"2019-11-05T10:05:00","endTime":"2019-11-05T12:00:00","summary":"Hands-on - Arbres à chats","description":"**Pitch**\n\nDéfi/concours par équipes ouvert à tous les profils.\nPréinscription nécessaire (places limitées)\nÀ gagner : séance d'escape game sur le thème des chats. \n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**\nAimer les jeux et apprendre\nÊtre pré-inscrit sur https://forms.gle/q1Ycd1zUPxKWy3MP8 et avoir été retenu.","attendees":["rdelaplace@xebia.fr","esiha@xebia.fr"]},{"id":"4b0goe7fc338hi2sglgal01367","startTime":"2019-11-05T10:05:00","endTime":"2019-11-05T12:00:00","summary":"Atelier - Serious game : Kapla 4 Devops","description":"**Pitch**\n \nSerious Game pour expérimenter la culture DevOps.\nA partir d'une situation classique de Dev et Ops non alignés, essais de solution, discussion autour de la culture DevOps.\n \n**Niveau**\n \ndébutant\n \n**Pré-requis**\n \nPar groupe de 10 personnes (séparées en 2 x 5)\nIdéalement, il faudrait avoir des petites salles pour isoler les groupes...","attendees":["ldussault@xebia.fr"]},{"id":"5f9rhoja5pri5qpal99edu2ep8","startTime":"2019-11-05T10:05:00","endTime":"2019-11-05T12:00:00","summary":"Formal - Atelier Prise de parole à la XebiCon, créneau 1","description":"La XebiCon approche et vous commencez à réfléchir au jour J lorsque vous serez devant 100 ou 200 personnes ?\nPour gérer cette prise de parole, participez à un atelier animé par Nolwenn (Publicis Sapient - https://vimeo.com/329834732), qui vous donnera des tips pour prendre la parole,  être à l'aise, commencer une présentation,  etc. (programme à affiner selon vos besoins)\n\nVous ne speakez pas à la XebiCon, mais l'atelier vous intéresse ? Vous êtes les bienvenu(e)s* ! \n* Sous réserve de places disponibles. Priorité aux Speakers de la XebiCon.","attendees":["abeauchart@xebia.fr"]},{"id":"50cp5op3smm55qciuh1ptf46oh","startTime":"2019-11-05T11:05:00","endTime":"2019-11-05T12:00:00","summary":"Formal - Delta Lake, un vernis pour Parquet","description":"**Pitch**\nDe l'upsert sur des fichiers Parquet ? Retrouver l'état de mes données de mercredi dernier ? Des transactions ACID sur mon datalake ? C'est désormais possible avec DeltaLake, la nouvelle librairie de Databricks qui ajoute un vernis 5 étoiles à Parquet.\n\n**Niveau**\nIntermédiaire (connaitre un minimum Spark) \n\n**Pré-requis**\nAucun","attendees":["aphelip@xebia.fr"]},{"id":"09hm78jll0sllho5pfjldqu2sj","startTime":"2019-11-05T12:05:00","endTime":"2019-11-05T13:00:00","summary":"Atelier - [Xebicon] Electrocardiogramme Agile","description":"Répétition pour la Xebicon (avec d'autres orateurs/animateurs qu'à l'origine)\n\n**Pitch**\n\nVenez tester votre compréhension de ce qu'est la vélocité et identifier les maux d'une équipe juste en regardant son historique de vélocité. \nQui aura le meilleur diagnostic ?\n\n**Niveau**\n \ndébutant\n \n**Pré-requis**\n \naucun\n \n**Logistique**\n \nN/A","attendees":["jbrambor@xebia.fr","aletaxin@xebia.fr"]},{"id":"09sf9mfhs5f8gbimd9okrlrrm6","startTime":"2019-11-05T12:05:00","endTime":"2019-11-05T12:30:00","summary":"Formal - [XebiCon] Collective ownership : We code together, we push together","description":"**Pitch**\n\nC'est l'histoire d'une équipe qui a décidé de travailler en mob programming au quotidien. À travers quelques petites scénettes, un product owner et une équipe de développeurs tentent d'illustrer le collective ownership avec les bonnes et les mauvaises pratiques ainsi que les différentes postures et situations fréquemment rencontrées.\n \n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**","attendees":["fcussac@xebia.fr","ponneby@xebia.fr","lseng@xebia.fr","achaabani@xebia.fr"]},{"id":"0g1tv8jv641kkmth1pi1d0cui3","startTime":"2019-11-05T12:05:00","endTime":"2019-11-05T12:30:00","summary":"Formal - [Xebicon] - E2E avec TestCafe","description":"**Pitch**\n\nVous en avez marre d'utiliser Selenium pour tester vos web apps ? Ou vous ne savez pas par ou commencer pour tester votre interface utilisateur ? Adoptez TestCafe, un framework en javascript ou en typescript pour automatiser vos tests end-to-end .\n\nJe vous propose d'explorer TestCafe de A a Z: l'installer, le configurer, ecrire des tests stables et les inscrire dans une CI pour les automatiser. On decouvrira egalement TestCafe Studio, l'IDE developpe par les createurs pour faciliter la creation de scenarios a tester sans ecrire de code.\n\nNous prendrons un exemple de projet concret que l'on testera step by step pour aller vers une connaissance approfondie des possibilites offertes par TestCafe.\n\nA la suite de ce talk, les developpeurs seront capables de creer un projet complet de testing pour leurs propres applications. Les PO et les clients intrigues seront convaincus et pourront participer a l'elaboration d'une strategie d'equipe pour tester les applications. \n\n**Niveau**\n\nmoyen\n \n\n**Pré-requis**\n\nJavascript","attendees":["jproust@xebia.fr"]},{"id":"47enb5fe24qtb2n5eji4rmf4ps","startTime":"2019-11-05T12:05:00","endTime":"2019-11-05T12:30:00","summary":"Formal - Découvrons les métiers de nos copains de Sapient - Episode 3 - Data Analytics","description":"Découvrez les multiples facettes du métier de consultant analytics et comment nous contribuons à poser les premières briques du suivi de performance dans la phase de création d’un produit.\n\nCette session fera un focus particulier sur comment nous impactons directement le quotidien de nos chers PO, data scientists ou dev front (#coucoulesxebians)","attendees":["camille.guerrier@publicissapient.com"]},{"id":"6f5tj2j36sbcehmj4hev1j5lhj","startTime":"2019-11-05T12:05:00","endTime":"2019-11-05T12:30:00","summary":"Formal [Xebicon] - Qu'attendre de votre outil de CI/CD en 2019 ?","description":"Tu aimes développer des applications serverless dans ton cloud provider favori et/ou lancer des containers dans Kubernetes, mais continue de traîner une grosse VM de CI/CD à côté de toute cette modernité ? Tu es un héros de l’ombre qui travaille sur des projets legacy et qui souhaite donner un coup de jeune à ta CI/CD ? Ne cherche pas plus loin, c’est le talk qu’il te faut. Nous verrons ce que l'on peut attendre d'un pipeline de CI/CD moderne : des concepts jusqu'aux outils.","attendees":["varrocena@xebia.fr"]},{"id":"0g9tsg1i4j37ggf2950em17956","startTime":"2019-11-05T12:35:00","endTime":"2019-11-05T13:00:00","summary":"Formal [Xebicon] - Kubeflow : Data Scientist ready ?","description":"**Pitch**\nIndustrialiser de la Data Science est le nouveau sujet à la mode. Ajoutez à cela une pincée de Kubernetes et vous retrouvez une recette de buzzwords. Lors d'une précédente démonstration, je me suis rendu compte de la difficulté de comprendre tout cet écosystème pour un Data Scientist. \n\nGoogle a depuis mis à disposition un série d'outil afin de permettre la scalabilité de projets de Deep Learning sous le nom de Kubeflow : contraction de Kubernetes et Tensorflow. Nous allons montrer l'utilisation de ces outils et essayer de répondre à une simple question : est-il Data Scientist ready ? \n**Niveau**\nMoyen\n**Prérequis**","attendees":["foueslati@xebia.fr"]},{"id":"4ckfv97orvla7pk4r1obu3t5vb","startTime":"2019-11-05T12:35:00","endTime":"2019-11-05T13:00:00","summary":"Formal - Xebicon -- What the UTC?","description":"**Pitch**\n\nEt si on prenait deux secondes pour se poser ?\n\nC'est quoi le temps ? Comment on le mesure ? GMT, UT1, UTC, secondes intercalaires... Est-ce vraiment utile de faire si compliqué ?\n\nEt dans mon code Java, au quotidien, je dois utiliser quels concepts pour pas être embêté plus tard ?\n\nAh et tant qu'on y est, j'ai des tests unitaires qui échouent quand on passe à l'heure d'hiver/d'été. Y'a un TODO dessus mais j'ai pas pris le temps de regarder...\n\nEt si on prenait deux secondes pour se poser ? Tenter de répondre à ces questions et mieux comprendre pourquoi gérer le temps c'est si compliqué ?\n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**\n\nAucun","attendees":["esiha@xebia.fr"]},{"id":"4eqs8henv2pema5ohp669scvp2","startTime":"2019-11-05T12:35:00","endTime":"2019-11-05T13:00:00","summary":"Formal - Les frameworks sont-ils des êtres vivants ? [XebiCon]","description":"**Pitch**\n\nMesdames, Messieurs,\nLe propos de cette présentation est de montrer que les mécanismes qui sont à l’oeuvre dans la nature s’appliquent également à nos frameworks, librairies et outils que nous utilisons au quotidien. Nos frameworks naissent, grandissent, se reproduisent et meurent tout comme les animaux, les plantes ou même les bactéries habitant notre planète. Ces fidèles compagnons du développeur vivent au sein d’écosystèmes et sont soumis à la sélection darwinienne au même titre que n’importe quelle espèce sur Terre. Pour soutenir ma théorie je m’appuierai sur des exemples et utiliserai les données issues de Google Trends et de Stack Overflow Trends qui permettent de voir l’évolution de l’usage de nos frameworks favoris dans le temps. En analysant les courbes produites par ces merveilleux outils il sera peut être même possible de prédire l’avenir de nos compagnons ou tout du moins d’imaginer une version plausible de celui-ci parmi l’ensemble des possibilités. A la fin de mon exposé lorsque vous devrez choisir un framework, une librairie ou un outil vous ne le ferez probablement plus de la même manière.\n\n**Niveau**\n\nDebutant\n\n**Pré-requis**\n\nAucun","attendees":["galbini@xebia.fr"]},{"id":"5svgavg185nipebgenl46m4q3f","startTime":"2019-11-05T12:35:00","endTime":"2019-11-05T13:00:00","summary":"Formal/Demo - Aws Cdk : infra as REAL code","description":"**Pitch**\n\n L'infra as code c'est pratique que ce soit *AWS Cloudformation*, *Azure Resource manager* ou *GCP Deployment* manager on peut générer facilement ses environnements de façon automatisé. \n\nOui mais comment faire si je veux \n\n- déployer une base de données en fonction des environnements, des régions ou même des dates ?\n- Répéter la création d'une instance plusieurs fois en changeant juste un paramêtre ?\n- ... \n\nBien souvent ces problématiques sont réglées par des duplications de fichiers yaml/json. \n\nGrace à Aws cdk ce temps est bientôt révolu, venez découvrir la joie de faire des if des boucles for, d'appréhender votre infrastructure selon un model objet ou même de l'exporter et de la partager au format de librairie !!!\n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**\n\nAucun","attendees":["oghizzo@xebia.fr"]},{"id":"7iieu6a7qpio74qli904dh9esf","startTime":"2019-11-05T13:05:00","endTime":"2019-11-05T14:00:00","summary":"Déjeuner","description":"Au foyer du 1er étage (à côté de l'auditorium)","attendees":[]},{"id":"6o7o60rh0o24ak963c8dkajscr","startTime":"2019-11-05T14:05:00","endTime":"2019-11-05T14:30:00","summary":"Newcomers","description":"","attendees":[]},{"id":"1vgsjv6hq4mgn3usc3e729qvg3","startTime":"2019-11-05T14:35:00","endTime":"2019-11-05T16:30:00","summary":"Formal - Atelier Prise de parole à la XebiCon, créneau 2","description":"La XebiCon approche et vous commencez à réfléchir au jour J lorsque vous serez devant 100 ou 200 personnes ?\nPour gérer cette prise de parole, participez à un atelier animé par Nolwenn (Publicis Sapient - https://vimeo.com/329834732), qui vous donnera des tips pour prendre la parole,  être à l'aise, commencer une présentation,  etc. (programme à affiner selon vos besoins)\n\nVous ne speakez pas à la XebiCon, mais l'atelier vous intéresse ? Vous êtes les bienvenu(e)s* ! \n* Sous réserve de places disponibles. Priorité aux Speakers de la XebiCon.","attendees":["abeauchart@xebia.fr"]},{"id":"3et0nqdtbsf1l1sl8iv2tbbmr2","startTime":"2019-11-05T14:35:00","endTime":"2019-11-05T15:00:00","summary":"Formal[Xebicon19] - Le potentiel du deep reinforcement learning","description":"**Pitch**\n \nDans ce talk, je vous propose de comprendre comment fonctionne le Deep Reinforcement Learning.\n\nJ'aborderai notamment les avantages et les particularités de différents algorithmes de Deep Reinforcement Learning à travers des explications techniques et des démonstrations visuelles. Nous prendrons également du recul sur la maturité de ce champ du Machine Learning afin d'évaluer les perspectives d'application en entreprise. \n\n**Niveau**\n moyen\n \n**Pré-requis**\n Aucun","attendees":["jjublanc@xebia.fr"]},{"id":"5a70uikg8dsvfooitt9sv1ec4d","startTime":"2019-11-05T14:35:00","endTime":"2019-11-05T15:00:00","summary":"Formal - [XEBICON]Comment j’ai encadré les comptes AWS de mes minions ?","description":"**Pitch:**\nPrésentation du nouveau bot qui gérera les créations de comptes/reset de mot de passe/récupération d'information des comptes AWS de Xebia France (Sujets abordés : AWS Lex, Cloudformation/Serverless, Lambda, Step function + Démo)\n\n**Niveau**\nDébutant/intermédiaire","attendees":["opietremont@xebia.fr"]},{"id":"6jqol3n07qpdclhm3kf2c2dhf4","startTime":"2019-11-05T14:35:00","endTime":"2019-11-05T16:30:00","summary":"Hands-on - Atelier de Story mapping prise en main pour Xebicon","description":"**Pitch**\n\nReprise atelier de Clement du Mois du ScM - Repet Xebicon\nDécouvrir l'atelier de story mapping pour définir la stratégie de développement  de votre produit\n\n**Niveau**\n\ndébutant \n\n**Pré-requis**\n\nPratique de l'écriture des US et des livraisons par incréments\n(ceci n'est pas un atelier d'écriture des US)","attendees":["iroques@xebia.fr","fzhamil@xebia.fr"]},{"id":"7b2fa41q9usm6pdmmml96ikfb7","startTime":"2019-11-05T14:35:00","endTime":"2019-11-05T16:30:00","summary":"Hands-on - Découvrir github actions","description":"**Pitch**\nHey, Github actions est arrivé !! C'est une vrai révolution ! \nBah oui, personne n'avait jamais pensé à intégrer une CI à un service git en ligne avant ! \n...\neuh attend... ça fait pas 2 ans que gitlab-ci existe ?\n\n2 ans après Github sort enfin son service de CI intégré : Github actions ! Encore en version béta (mais plus pour longtemps), on vous propose de découvrir avec nous ce qu'il a à nous offrir. Sa philosophie, ses features clés, ses projets d'avenir....\n\n\\#troll : ce slot n'a pas vocation de troll envers une autre plateforme de CI, surtout celles représentées par des moustachus (mais bon... Si c'est gratuit...)\n \n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**\nUn laptop avec git par personne\ndes tables pour tout le monde\ntélévision / vidéo projecteur","attendees":["fcussac@xebia.fr","glhermenier@xebia.fr"]},{"id":"3m774ha8mfoiusefp68im4pmds","startTime":"2019-11-05T15:05:00","endTime":"2019-11-05T15:30:00","summary":"Formal API Design , Integration Principles , Best Practices","description":"This session would focus on API design and documentation.\nAlso I would cover some generic integration examples ( modifying the requests via API Gateway) , At the end of the session I would cover best practises and a little about API security.","attendees":["rahul.omar@publicissapient.com"]},{"id":"75qmlh80mhjvf192unocic716t","startTime":"2019-11-05T15:05:00","endTime":"2019-11-05T15:30:00","summary":"Formal - Spark sur K8S avec S3 [XebiCon]","description":"**Pitch**\n\nVenez découvrir comment exécuter du code Spark sous K8S en utilisant S3 comme FS.\n \n**Niveau**\n \ndébutant / moyen\n \n**Pré-requis**\nPour gagner du temps avoir déjà sur son ordi :\nDocker / Kubernetes / Helm","attendees":["galbini@xebia.fr","sdossantos@xebia.fr"]},{"id":"2avtj7rtv8p10frqd3f3vcnvl0","startTime":"2019-11-05T15:35:00","endTime":"2019-11-05T16:00:00","summary":"Formal - [Xebicon]Time Series Made Easy, le retour !","description":"La prévision des séries temporelles est un domaine de la data science présent au cœur de nombreuses activités d'entreprise. Cependant, il s’agit d’un territoire souvent inexploré en raison de sa complexité: utiliser et optimiser les modèles classiques de prédiction temporelle nécessite en effet une connaissance approfondie de leurs rouages mathématiques.\nAujourd'hui, il existe des outils pour travailler rapidement avec des times series d’une façon plus facile et pragmatique à l'instar de Prophet de Facebook, GluonTs d’Amazon et Amazon forecasting de AWS.\n\nVenez découvrir ces outils et les prédictions rapides et de qualité qu’ils permettent !","attendees":["vvillet@xebia.fr","sbenfredj@xebia.fr"]},{"id":"69volk92kjvae3fuspm65h8s8g","startTime":"2019-11-05T15:35:00","endTime":"2019-11-05T16:00:00","summary":"Formal - Quarkus, Micronaut : Java is Back -- Xebicon","description":"**Pitch**\n\nJava est un des langages les plus utilisés dans le développement logiciel mais la JVM connaît cependant deux problèmes de taille : sa vitesse de démarrage et son espace mémoire. Parfaitement adapté à nos anciennes applications monolithiques et on premise, Java peine à suivre les nouvelles architectures divisées en de nombreux micro services, potentiellement sur le cloud, avec de nombreux besoins de scalabilité.\n\nHeureusement pour tous les JavaFans, de nouvelles solutions apparaissent pour s'adapter aux besoins des entreprises, modifiant les tréfonds de l'exécution du code Java.\n\nGrâce à Quarkus et Micronaut, Java peut espérer redevenir un langage de prédilection pour nos micro-services.\n\n\n**Niveau**\n \n🌶️","attendees":["karchet@xebia.fr","lguez@xebia.fr"]},{"id":"5kv653dc3vs3840ocic8i9gcdo","startTime":"2019-11-05T16:05:00","endTime":"2019-11-05T16:30:00","summary":"Les Notebooks Jupyter en mode level up selon Netflix, et les autres grands du Web","description":"Les notebooks en général, et Jupyter en particulier, sont souvent vus comment le coûteau suisse du Data Scientist. Ils lui permettent d'effectuer des analyses, et même de mettre au point des modèles de machine learning. Nous sommes toutefois, plus souvent proche de l'art de la bidouille que de l'usage industrialisé de l'outil. C'est pourquoi nous vous proposons dans cette session de découvrir comment Netflix et d'autres grands du Web utilisent les Notebooks Jupyter, et comment il est possible de concilier pratiques DevOps et industrialisation avec Jupyter.","attendees":["akinsella@xebia.fr","nlaille@xebia.fr"]},{"id":"7h9el9ib4fj7uero7jjt9p0jsd","startTime":"2019-11-05T16:05:00","endTime":"2019-11-05T16:30:00","summary":"Formal - [XebiCon] Management @ Xebia : REX People Centric","description":"**Pitch**\n \nRetour sur l'implémentation du management chez Xebia. Les contraintes, les outils, les réussites et les échecs.\n\nLe manageur est un mot qui fait peur, synonyme d'ascension professionnelle, venez découvrir comment chez Xebia nous avons réinventé le rôle pour en faire un sujet épanouissant, au service de l'autre.\n \n**Niveau**\n \n🌶️\n\n#craft","attendees":["blacroix@xebia.fr","jsmadja@xebia.fr"]},{"id":"0uunih12ig275cqsfbgbnogof2","startTime":"2019-11-05T16:35:00","endTime":"2019-11-05T17:30:00","summary":"Lightning talks","description":"<br>Docker est mort, vive Docker !<br><br>**Pitch**<br>Répétition XebiCon.<br><br>Docker est désormais partout. Mais que fait réellement Docker ? Y a-t-il encore un sens à parler de Docker maintenant qu'il s'agit du simple packaging du projet [Moby](<a href=\"https://mobyproject.org/\">https://mobyproject.org/</a>), qui lui-même n'est qu'une interface vers [containerd](<a href=\"https://containerd.io/\">https://containerd.io/</a>) et [runc](<a href=\"https://runc.io/\">https://runc.io/</a>) ? Le sujet de \"build des conteneurs Docker sans Docker\" est sur toutes les lèvres de l'écosystème Kubernetes. Côté runtime, Docker en vient de plus en plus a être remplacé. Faisons le point sur cette situation et l'avenir potentiel de Docker.<br><br>**Niveau**<br>Tout le monde<br>&nbsp;<br>**Pré-requis**<br>Aucun<br><br>--<br><br>Architecture &amp; Documentation : les ADRs en 5 minutes<br><br>**Pitch**<br>&nbsp;<br>La documentation des décisions d'architecture n'est généralement pas quelque chose d'évident. En l'espace de 5 minutes, je vous propose de vous présenter une solution efficace et légère avec les ADRs.<br>&nbsp;<br>**Niveau**<br>&nbsp;<br>débutant<br>&nbsp;<br>**Pré-requis**<br>Aucun<br><br>--<br><br>Lightning - Mermaid, les flowcharts &amp; diagrammes de séquence as code !<br><br><br>**Pitch**<br>Sérieusement, qui a envie de passer 15 ans à aligner des textbox et s'assurer que des lignes soient droites pour faire un schéma ou un flowchart d'auth (au hasard) ? Venir découvrir Mermaid, qui vous permet de décrire ça de manière concise et textuelle, puis de générer l'image qui y correspond :)<br><br>**Niveau**<br>Tout le monde<br>&nbsp;<br>**Pré-requis**<br>Aucun<br><br>--<br><br>Formal - [Xebicon] Le meilleur développeur mobile est-il côté back ?<br><br>**Pitch**<br>Dans les transports, en voyage ou simplement dans son lit, l’usage du mobile est partout. Partageons ensemble les moyens d’échanger l’information entre le back et les applications.<br><br>Avec une batterie et un réseau limité, comment exposer sa donnée pour créer une application mobile performante ?<br><br>Repartez avec des idées pour organiser votre système d’information et créer de meilleures applications.<br><br>**Niveau**<br>Débutant<br><br>**Pré-requis**<br>aucun<br><br>--<br><br>Survivre en entreprise avec un Linux<br><br>Chacun devrait être libre d’utiliser l’OS de son choix. Cependant, lorsqu’on est en entreprise et encore plus dans un grand groupe, on est souvent cantonné à Mac (berk) ou à Windows (double berk). Et encore, ça, c’est uniquement quand on a le choix. Alors comment faire ?<br><br>--<br><br>12Factor<br><br><br>**Pitch**<br>Il y a des années, Heroku énoncaient les 12factor : 12 critères que devrait idéalement respecter votre application pour être buildable, déployable et scalable automatiquement. Devinez quoi ? Ils sont toujours valables. Venez les découvrir en 5 minutes !<br><br>**Niveau**<br>Tout le monde<br>&nbsp;<br>**Pré-requis**<br>Aucun<br><br>--<br><br>Strong Style Pairing<br><br><br>**Pitch**<br>Vous faites du pair programming ? Est-ce que vous vous échangez le clavier régulièrement ? Et la comprehension du code que vous écrivez est elle claire ? Y a-t'il une meilleur façon de faire du pair programming ?<br><br>**Niveau**<br><br>débutant<br>-- <br><br>Veille technologique et side project<br><br>Et si notre veille technique passait par les sides project?<br><br>Repet de Xebicon","attendees":["achotard@xebia.fr","ponneby@xebia.fr","cdreyfus@xebia.fr","sdecout@xebia.fr","sbuisson@xebia.fr","agenet@xebia.fr"]},{"id":"4fma6itvq0cktbj36hklv53udl","startTime":"2019-11-05T16:35:00","endTime":"2019-11-05T17:30:00","summary":"Scaleway, le Rex dont vous êtes le héros.","description":"En 1,5 an chez Scaleway, il a fallu faire des choix... Mais auriez vous fait les même? Ce Rex participatif est confidentiel : PAS DE TWEET, PAS DE PHOTOS. Merci!","attendees":["crochas@xebia.fr"]},{"id":"4hqovg0q1ircipv29m9hc70o1n","startTime":"2019-11-05T16:35:00","endTime":"2019-11-05T17:00:00","summary":"Formal - Introduction à CloudFormation/Troposphere","description":"**Pitch**\n\nAprès un rapide rappel/vernis sur CloudFormation, prenons un peu de hauteur avec Troposphere, ou comment alléger la manipulation de stacks CloudFormation.\n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**\nSavoir ce qu'est un cloud.\nConnaître le principe de l'infra-as-code.","attendees":["fdebuire@xebia.fr","esiha@xebia.fr"]},{"id":"4htbcn5bc28er1ss3pmcttfv0g","startTime":"2019-11-05T16:35:00","endTime":"2019-11-05T17:00:00","summary":"Formal - Introduction à gRPC, pourquoi et quand l'utiliser ?","description":"**Pitch**\n\ngRPC existe depuis quelques années déjà. Avons-nous cependant déjà eu l'occasion de l'évaluer ou de le mettre en place ? Ne privilégie-t-on pas, un peu trop systématiquement, une approche des échanges entre applications fondée sur des APIs REST ?\n\ngRPC est pourtant une alternative intéressante pour bien des aspects : performance et compatibilité. Ce talk vous présentera donc les principes derrière gRPC, comment on l'utilise et les cas dans lesquels il s'avère être une meilleure alternative aux APIs REST.\n \n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**","attendees":["sdossantos@xebia.fr"]},{"id":"77ppr7n9dmffbghcgv7i1io7s8","startTime":"2019-11-05T16:35:00","endTime":"2019-11-05T17:00:00","summary":"Formal - Une nouvelle venue : l'offre eXtreme Orga Agile (parce que y a pas que l'Archi dans la vie)","description":"**Pitch**\n\nA la demande d'un prospect, DxO, nous avons conçu une nouvelle offre que nous tentons d'expérimenter chez eux. Elle est le fruit du travail de Laurène, Olivier, Arnaud, Clément, Gwénaël et Antoine.\n\nOn s'en parle ?\n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**\n\nNA","attendees":["amarcou@xebia.fr"]},{"id":"1ogotfd9lv00p8p8avjakrevlo","startTime":"2019-11-05T17:05:00","endTime":"2019-11-05T17:30:00","summary":"Formal - [Xebicon] Serverless : Guide de survie pour partir en prod","description":"**Pitch**\nLe monde du serverless est aujourd’hui mature et l’utiliser en production est totalement viable.\n\nMais quel est l’impact d’une telle architecture sur l’organisation du code et de l’équipe ? De plus, si un tel système se veut scalable par nature, comment répondre aux autres problématiques inhérentes à une production ? Traçabilité end to end, testabilité, configuration, maintenance ...\n\nAprès plusieurs projets réalisés avec les technologies Serverless d’AWS nous vous compilons tous les patterns et les astuces pour aboutir à une production robuste, testable et observable.\n\nDans ce talk, fini les Hello World, place à la production, la vraie !\n\n**Niveau**\nAvoir déjà fait un Hello World en Lambda AWS de préférence et être familiarisé avec les services AWS.\n\n**Pré-requis**\naucun","attendees":["mpichou@xebia.fr","jpinsolle@xebia.fr"]},{"id":"4jbhpbc3ibenpqnd947rfm1n3a","startTime":"2019-11-05T17:05:00","endTime":"2019-11-05T17:30:00","summary":"Formal [Xebicon] - WebAssembly - Mythe ou réalité","description":"[Répétition de slot Xebicon]\n\nWebAssembly est un standard du Web, créé en 2015, il promet de compiler du C./C++, du Rust et du Typescript dans le but d'être exécuté directement dans un navigateur en obtenant des performances proches des applications natives, certains parlent de ce dernier comme étant LA technologie qui détruira Javascript.\n\nNous allons voir ensemble au cours de ce slot ce que permet concrètement WebAssembly, comment il fonctionne et voir s'il tient toutes ses promesses.","attendees":["vsegouin@xebia.fr"]},{"id":"7mflhiqqeeic2lh2mmdrdnls4d","startTime":"2019-11-05T17:05:00","endTime":"2019-11-05T17:30:00","summary":"Talk - Humanistic Park : De l'économie de production à l'économie de création","description":"**Pitch**\n\nLe monde évolue, la place de la créativité n'a jamais été aussi importante, la technologie prenant petit à petit le relais sur la production.\n\nOn va parler évolution (Darwin mec !), on va parler d'un ours polaire, y'aura des astéroïdes et même un dinosaure certifié ! \n\nLe but de ce talk est de générer chez nos clients une prise de conscience, un léger électrochoc : évoluez ! ...ou mourrez ! \n\n**Niveau**\n\ndébutant\n \n\n**Pré-requis**\n\nAimer les mecs qui partent en live","attendees":["abrebant@xebia.fr"]},{"id":"0bkvq25ujki740a0haihbme02t","startTime":"2019-11-05T17:35:00","endTime":"2019-11-05T18:30:00","summary":"1H - Fondation Web","description":"","attendees":[]},{"id":"2ph2pqhloopgl6g6ffjpmi8br1","startTime":"2019-11-05T17:35:00","endTime":"2019-11-05T18:30:00","summary":"Architectural principles : la conclusion","description":"15 ou 30 min  - Atelier \nSuite de l'atelier du mois d'octobre, pour finaliser les cartes","attendees":["plopez@xebia.fr"]},{"id":"6s2gp1m4tfa9tohsk2npp9rjj6","startTime":"2019-11-05T17:35:00","endTime":"2019-11-05T20:00:00","summary":"After XKE et partage","description":"","attendees":[]},{"id":"7bblldjqcvf27t0v7hnik24bfd","startTime":"2019-11-05T17:35:00","endTime":"2019-11-05T18:30:00","summary":"Mentoring - Container Summer School","description":"**Pitch**\nCe slot est une session du \"mentoring\" sur les Conteneurs : la Container ~Summer~ School.\nLes participants sont déjà connus et ce slot est la 9e occurence d'une session hebdomadaire de formation conteneurs interne. Pour plus d'infos, voir le mail \"Container (Summer ?) School\". Si vous souhaitez venir, la porte sera ouverte, mais attendez vous à arriver en plein milieu d'une suite de sujets !\n\n**Niveau**\nDébutant/intermédiaire\n\n**Pré-requis**\nFaire partie des participants à la Container ~~Summer~~ School ou accepter de venir en observateur en cours de route :)","attendees":["achotard@xebia.fr"]},{"id":"7l0jd4bb7nrv1amb2pm8g24rp4","startTime":"2019-11-05T17:35:00","endTime":"2019-11-05T18:30:00","summary":"Fondation agile","description":"","attendees":[]}]